Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/delete_folio.po
Languages: cs

source: Delete Folio
cs: Smazání listu

source: QElectroTech allows deleting `folios`_ from a `project`_ from `menu bar`_ and `projects panel`_.
cs: QElectroTech umožňuje mazání `listů`_ v `projektu`_ přes `hlavní nabídku`_ a `panel s projekty`_.

source: Delete folio from menu bar
cs: Smazání listu přes hlavní nabídku

source: Select **Project > Delete this folio** menu item to delete the active `folio`_.
cs: Pro smazání činného `listu`_ vyberte položku nabídky **Projekt > Smazat list**.

source: Figure: QElectroTech Project menu
cs: Obrázek: Nabídka projektu v QElectroTechu

source: Delete folio from projects panel
cs: Smazání listu přes panel s projekty

source: Right click on the `folio`_ which should be deleted.
cs: Klepněte pravým tlačítkem myši na `list`_, který se má smazat.

source: Click the option **Delete this folio** to delete the selected `folio`_.
cs: Pro smazání vybraného `listu`_ klepněte na volbu **Smazat list**.

source: Figure: QElectroTech Project panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `projects panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**
