Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/select/select_none.po
Languages: cs

source: Select none
cs: Zrušení výběru

source: To be sure that any `part`_ is selected before any action, QElectroTech provides the option to unselect all `parts`_ from the `workspace`_. This option is useful for avoiding undesired changes.
cs: Chcete-li se ujistit, že před jakoukoli činností není vybrána žádná `část`_, QElectroTech poskytuje možnost zrušit výběr všech `částí`_ v `pracovní ploše`_. Tato možnost je užitečná pro vyhnutí se nežádoucím změnám.

source: Unselecting all `parts`_ can be done from `menu bar`_ or using the corresponding keyboard shortcut.
cs: Odznačení všech `části`_ lze provést přes `hlavní nabídku`_ nebo pomocí odpovídající klávesové zkratky.

source: Select none from menu bar
cs: Zrušení výběru přes hlavní nabídku

source: Select **Edit > Select none** to unselect all selected `parts`_.
cs: Pro zrušení výběru všech vybraných `části`_ vyberte položku nabídky **Úpravy > Zrušit výběr**.

source: Figure: QElectroTech element editor Edit menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Select none using keyboard shortcut
cs: Zrušení výběru pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + Shift + a`` to unselect all selected `parts`_.
cs: Pro zrušení výběru všech vybraných `části`_ stiskněte ``Ctrl + Shift + a``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
