Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/settings_grid.po
Languages: cs

source: Grid settings
cs: Nastavení mřížky

source: QElectroTech provides a grid displayer for the `workspace`_ which makes easier the drawing work.
cs: QElectroTech poskytuje mřížkový zobrazovač pro `pracovní plochu`_, který dělákreslicí práce snadnějšími.

source: To configurate the grid displayed:
cs: Pro nastavení zobrazené mřížky:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazení` vyskakovacího okna s nastavením QElectroTechu.

source: Go to **General** section.
cs: Jděte do části **Obecné**.

source: Go to **Grid + Keyboard** tab.
cs: Jděte na kartu **Mřížka + klávesnice**.

source: Define the X and Y pixels of the grid cell. The cell size can be between 1 and 30 pixels.
cs: Stanovte pixely X a Y buňky mřížky. Velikost buňky může být mezi1 a 30 obrazovými body (pixely).

source: The number of grid cells displacement using the keyboard or the scroll bar can also be defined at the same section where the grid characteristics are defined. Standar and accurat scroll (with **ALT** key) can be defined.
cs: Počet posunutí buněk mřížky pomocí klávesnice nebo posuvníku lze tstanovit i ve stejné části, kde jsou stanoveny charakteristiky mřížky.Lze stanovit standarní a přesný posuv (pomocí klávesy **Alt**).

source: To display the grid at the `workspace`_, refer to `toolbars`_ section.
cs: Na to, jak zobrazit mřížku na `pracovní ploše`_, se podívejte v části k `nástrojovým panelům`_ .

source: Figure: QElectroTech grid settings
cs: Obrázek: Nastavení mřížky v QElectroTechu
