Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/settings_export.po
Languages: cs

source: Export settings
cs: Nastavení vyvedení

source: QElectroTech allows predefining export settings for reducing the working configuration effort each time that a `project`_ have to be exported.
cs: QElectroTech umožňuje předem stanovit nastavení vyvedení pro omezení pracovníhoúsilí spojeného s nastavováním pokaždé, když je třeba `projekt`_ vyvést.

source: The default exporting settings which can be choosed are:
cs: Výchozí nastavení vyvedení, která lze zvolit, jsou:

source: Default target directory.
cs: Výchozí cílový adresář.

source: Default exporting format (**PNG**, **JPEG**, **Bitmap**, **SVG** or **DXF**).
cs: Výchozí formát pro vyvedení (**PNG**, **JPEG**, **Bitmap**, **SVG** nebo **DXF**).

source: Default rendering options:
cs: Výchozí možnosti vykreslení:

source: Draw or not borders.
cs: Kreslit nebo nekreslit ohraničení.

source: Title block.
cs: Záhlaví výkresu.

source: Draw grid.
cs: Kreslit mřížku.

source: Draw terminals.
cs: Kreslit koncovky.

source: Keep conductor colors or monochrome.
cs: Dodržet barvy vodičů nebo je dělat černobílé.

source: To define default export settings:
cs: Pro stanovení výchozího nastavení vyvedení:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazení` vyskakovacího okna s nastavením QElectroTechu.

source: Go to **Export** section.
cs: Jděte do části **Vyvedení**.

source: Select the desired setting values for each field.
cs: Vyberte požadované hodnoty nastavení pro každé pole.

source: Press **OK** button to save the configuration changes.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení.

source: Figure: QElectroTech export settings
cs: Obrázek: Nastavení vyvedení v QElectroTechu

source: For more information about QElectroTech export options, refer to `export`_ section.
cs: Další informace o volbách pro vyvádění v QElectroTech najdete v části k `vyvedení`_.
