Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_parts/arc.po
Languages: cs

source: Arc
cs: Oblouk

source: Create arc
cs: Vytvoření oblouku

source: The arc can only be added to `workspace`_ from `toolbar`_.
cs: Oblouk lze do `pracovní plochy`_ přidat pouze z `panelu nástrojů`_.

source: Select the icon |icon_arc| from `toolbar`_ to add an arc.
cs: Pro přidání oblouku vyberte v `panelu nástrojů`_ ikonu |icon_arc|.

source: Click at the position from the start point of the arc in the `workspace`_.
cs: Klepněte na polohu počátečního bodu oblouku v `pracovní ploše`_.

source: Click at the position from the end point of the arc in the `workspace`_. The default arc has always an angle of 90 degrees.
cs: Klepněte na polohu koncového bodu oblouku v `pracovní ploše`_. Výchozí oblouk má vždy úhel 90 stupňů..

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Parts**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Části**.

source: Arc properties
cs: Vlastnosti oblouku

source: Element part proterties can be displayed from `information panel`_ when the part is selected.
cs: Vlastnosti části prvku lze zobrazit v ʻinformačním panelu`_, když ječást vybrána.

source: If the `information panel`_ is not displayed, it can be displayed from **Settings > Display > Information**.
cs: Pokud se `panel s údaji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Informace**.

source: Figure: QElectroTech arc part from element
cs: Obrázek: Část oblouk v prvku v QElectroTechu

source: QElectroTech allows customizing different arc properties:
cs: QElectroTech umožňuje přizpůsobení různých vlastností oblouku:

source: Appearence
cs: Vzhled

source: Color
cs: Barva

source: The outline color and the filling color of the part can be defined from a list of pre-defined colors. At the case of the arc part the filling color is **None**.
cs: Barvu obrysu a barvu výplně části lze stanovit v seznamu předem stanovených barev. V případě obloukové části je barva výplně **Žádná**.

source: Style
cs: Styl

source: The type of outline representation can be chosen between: Normal (Continuous), Dashed, Dotted or, Dots and dashes.
cs: Typ znázornění obrysu lze vybrat mezi: Normální(spojitý), Čárky, Tečky nebo, Čárky a tečky.

source: Thickness
cs: Tloušťka

source: The outline thickness (Weight) can be chosen between: None, Thin, Normal, Strong or High.
cs: Tloušťku obrysu (váha) lze zvolit mezi: Žádná, Tenká, Běžná,Silný nebo Hodně silná.

source: Geometry
cs: Geometrie

source: Coordenates
cs: Souřadnice

source: The coordinates (x, y) from the ellipse center point can be defined.
cs: Lze stanovit souřadnice (x, y) středu elipsy.

source: Dimensions
cs: Rozměry

source: The horizontal and vertical (minimum and maximum or maximum and minimum) diameters from the ellipse can be defined.
cs: Lze stanovit vodorovné a svislé (nejmenší a největší nebo největší a nejmenší)průměry elipsy.

source: Point
cs: Bod

source: The position of initial point and end point are defined as angle of the radius betuen the center and the respective point with the horizontal diameter. The angle value follows the mathematical rules, anti-clockwise for positive angles.
cs: Poloha počátečního a koncového bodu je stanovena jako úhelpoloměru mezi středem a příslušným bodem s vodorovnýmprůměrem. Hodnota úhlu se pro kladné úhly řídí matematickými pravidly proti směru hodinových ručiček.

source: Arc extreme points definition
cs: Stanovení krajních bodů oblouku

source: QElectroTech allows defining the arc extreme points from `information panel`_ or `workspace`_.
cs: QElectroTech umožňuje stanovit krajní body oblouku v `informačnímpanelu`_ nebo v `pracovní ploše`_.

source: Figure: QElectroTech arc extreme point
cs: Obrázek: Krajní bod oblouku v QElectroTechu

source: Arc extreme points definition from information panel
cs: Stanovení krajních bodů oblouku v informačním panelu

source: Select the arc to display the rectangle properties at `information panel`_.
cs: Pro zobrazení vlastnosti oblouku v `informačním panelu`_ vyberte oblouk.

source: Define the start angle, the angle from the diamete of the start point and the horizontal axes.
cs: Stanovte počáteční úhel, úhel průměru počátečního bodu a vodorovné osy.

source: Define the angle from the initial point and the end point of the arc.
cs: Stanovte úhel počáteční bodu a koncového bodu oblouku.

source: Press intro.
cs: Stiskněte intro.

source: **Select none** from **Edit** menu or use ``Ctrl + Shift + a`` keyboard shortcut.
cs: **Zrušte výběr** v nabídce **Úpravy** nebo použijte klávesovou zkratku ``Ctrl + Shift + a``.

source: Arc extreme points definition from workspace
cs: Stanovení krajních bodů oblouku v pracovní ploše

source: Select the arc drawn at the `workspace`_. The arc line changes to red color and the control of the arc ellipse point to blue.
cs: Vyberte oblouk nakreslený v `pracovní ploše`_. Čára oblouku se změní na červenoubarvu a ovládání elipsy oblouku na modrou.

source: Select the arc again. The line continues in red and the points change to green color.
cs: Znovu vyberte oblouk. Čára pokračuje červeně a body se změní nazelenou barvu.

source: Select the arc for third time. The line continues in red and at this time only one extreme points are, the color is pink.
cs: Vyberte oblouk potřetí. Čára pokračuje červeně a v tuto chvílije pouze jeden krajní bod, barva je růžová.

source: Displace the pink points arround the ellipse outline.
cs: Umístěte růžové body kolem obrysu elipsy.
