Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_parts/dynamic_text.po
Languages: cs

source: Dynamic text
cs: Dynamický text

source: The dynamic text field is an object that displays a text that is comming from a variable value. The text value is changing with the variable is changed, editing the part is not necessary to change the text content.
cs: Dynamické textové pole je předmět, který zobrazuje text, který přicházíz proměnné hodnoty. Textová hodnota se mění se změnou proměnné. Pro změnu textového obsahu není úprava části nutná.

source: Create dynamic text
cs: Vytvoření dynamického textu

source: The text field can only be added to `workspace`_ from `toolbar`_.
cs: Textové pole lze do `pracovní plochy`_ přidat pouze z `pruhu s nástroji`_.

source: Select the icon |icon_dynamic_text| from `toolbar`_ to add a dynamic text field.
cs: Pro přidání dynamického textového pole vyberte v `nástrojovém panelu`_ ikonu |icon_dynamic_text|.

source: Click the positional point from the text field in the `workspace`_.
cs: Klepněte na polohový bod textového pole v `pracovní ploše`_.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Parts**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Části**.

source: Dynamic text properties
cs: Vlastnosti dynamického textu

source: Element part proterties can be displayed from `information panel`_ when the part is selected.
cs: Vlastnosti části prvku lze zobrazit v ʻinformačním panelu`_, když ječást vybrána.

source: If the `information panel`_ is not displayed, it can be displayed from **Settings > Display > Information**.
cs: Pokud se `panel s údaji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Informace**.

source: Figure: QElectroTech dynamic text field part from element
cs: Obrázek: Část dynamické textové pole v prvku v QElectroTechu

source: QElectroTech allows customizing different text properties:
cs: QElectroTech umožňuje přizpůsobení různých vlastností textu:

source: Placement
cs: Umístění

source: Position
cs: Poloha

source: The dynamic text coordinates (x, y) can be defined.
cs: Lze stanovit souřadnice (x, y) dynamického textu.

source: Rotation
cs: Otočení

source: The text display angle can be defined in the range of 0 to 360 degrees.
cs: Úhel zobrazení textu lze stanovit v rozsahu 0 až 360 stupňů.

source: Frame
cs: Rámeček

source: The posibility to display the text inside a rectangle frame is provided.
cs: Je poskytována možnost zobrazit text uvnitř obdélníkového rámečku.

source: Alignemnt
cs: Zarovnání

source: The text position inside the frame can be defined. Left, center or right and top, middle or bottom.
cs: Lze stanovit polohu textu uvnitř rámečku. Vlevo, uprostřed nebo vpravoa nahoře, uprostřed nebo dole.

source: Content
cs: Obsah

source: Source
cs: Zdroj

source: The source content can be user text (similar to static text), element information parameter or composite text.
cs: Zdrojovým obsahem může být uživatelský text (podobně jako statický text),parametr informace prvku nebo složený text.

source: Size
cs: Velikost

source: The text size can be defined.
cs: Lze stanovit velikost textu.

source: Color
cs: Barva

source: The text color can be choosed from RGB color code database.
cs: Barvu textu lze vybrat z databáze kódů barev RGB.
