Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_parts/line.po
Languages: cs

source: Line
cs: Čára

source: Create line
cs: Vytvoření čáry

source: The line can only be added to `workspace`_ from `toolbar`_.
cs: Čáru lze do `pracovní plochy`_ přidat pouze z `pruhu s nástroji`_.

source: Select the icon |icon_line| from `toolbar`_ to add a line.
cs: Pro přidání čáry vyberte v `panelu nástrojů`_ ikonu |icon_line|.

source: Click on the initial point from the line in the `workspace`_.
cs: Klepněte na počáteční bod čáry v `pracovní ploše`_.

source: Click on the end point from the line in the `workspace`_.
cs: Klepněte na koncový bod čáry v `pracovní ploše`_.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Parts**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Části**.

source: Line properties
cs: Vlastnosti čáry

source: Element part proterties can be displayed from `information panel`_ when the part is selected.
cs: Vlastnosti části prvku lze zobrazit v ʻinformačním panelu`_, když ječást vybrána.

source: If the `information panel`_ is not displayed, it can be displayed from **Settings > Display > Information**.
cs: Pokud se `panel s údaji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Informace**.

source: Figure: QElectroTech line from element
cs: Obrázek: Část čára v prvku v QElectroTechu

source: QElectroTech allows customizing different line properties:
cs: QElectroTech umožňuje přizpůsobení různých vlastností čáry:

source: Appearence
cs: Vzhled

source: Color
cs: Barva

source: The outline and filling color of the part can be defined from a list of pre-defined colors. At the case of the line part the filling color is **None**.
cs: Barvu obrysu a barvu výplně části lze stanovit v seznamu předem stanovených barev. V případě čárové části je barva výplně **Žádná**.

source: Style
cs: Styl

source: The outline representation type can be chosen between: Normal (Continuous), Dashed, Dotted or, Dots and dashes.
cs: Typ znázornění obrysu lze vybrat mezi: Normální(spojitý), Čárky, Tečky nebo, Čárky a tečky.

source: Thickness
cs: Tloušťka

source: The outline thickness (Weight) can be chosen between: None, Thin, Normal, Strong or High.
cs: Tloušťku obrysu (váha) lze zvolit mezi: Žádná, Tenká, Běžná,Silný nebo Hodně silná.

source: Geometry
cs: Umístění

source: Coordenates
cs: Souřadnice

source: The start and end point coordinates (x, y) can be defined.
cs: Lze stanovit souřadnice (x, y) počátečního a koncového bodu.

source: End point
cs: Koncový bod

source: The extrem point from the line can be represented individually as:
cs: Krajní bod přímky lze jednotlivě znázornit jako:

source: Normal
cs: Normální

source: The extrem point is represented as the rest of the line, there is no different representation for the end point.
cs: Krajní bod je znázorněn jako zbytek čáry. Pro koncový bod není žádnéjiné znázornění.

source: Simple arrow
cs: Jednoduchá šipka

source: The extrem point is represented as a filled arrow.
cs: Krajní bod je znázorněn jako vyplněná šipka.

source: Triangle arrow
cs: Trojúhelníková šipka

source: The extrem point is represented as an empty triangle arrow.
cs: Krajní bod je znázorněn jako prázdná trojúhelníková šipka.

source: Circle
cs: Kruh

source: The extrem point is represented as an empty circle.
cs: Krajní bod je znázorněn jako prázdný kruh.

source: Diamond
cs: Kosočtverec

source: The extrem point is represented as an empty diamond.
cs: Krajní bod je znázorněn jako prázdný kosočtverec.
