Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_parts/terminal.po
Languages: cs

source: Terminal
cs: Svorka

source: A terminal is a part from the `element`_ that will allow a connection with one `conductor`_ during the schema creation.
cs: Svorka je část `prvku`_, která během vytváření výkresu umožní připojení jedním `vodičem`_.

source: Create terminal
cs: Vytvoření svorky

source: The terminal can only be added to `workspace`_ from `toolbar`_.
cs: Svorku lze do `pracovní plochy`_ přidat pouze z `pruhu s nástroji`_.

source: Select the icon |icon_terminal| from `toolbar`_ to add a terminal.
cs: Pro přidání svorky vyberte v `panelu nástrojů`_ ikonu |icon_terminal|.

source: Click on the initial point from the terminal in the `workspace`_ to add the terminal.
cs: Pro přidání svorky klepněte na počáteční bod svorky v `pracovní ploše`_.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Parts**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Části**.

source: Terminal properties
cs: Vlastnosti svorky

source: Element part proterties can be displayed from `information panel`_ when the part is selected.
cs: Vlastnosti části prvku lze zobrazit v `informačním panelu`_, když je část vybrána.

source: If the `information panel`_ is not displayed, it can be displayed from **Settings > Display > Information**.
cs: Pokud se `panel s údaji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Informace**.

source: Figure: QElectroTech terminal part from element
cs: Obrázek: Část svorka v prvku v QElectroTechu

source: QElectroTech allows customizing different terminal properties:
cs: QElectroTech umožňuje přizpůsobení různých vlastností svorky:

source: Position
cs: Poloha

source: The start point coordinates (x, y) can be defined.
cs: Lze stanovit souřadnice (x, y) počátečního bodu.

source: Orientation
cs: Natočení

source: The exit direction from the connector can be defined. The four possible orientations are *North*, *East*, *South* and *West*.
cs: Lze stanovit směr výstupu svorky. Čtyřmi možnými směry natočení jsou *sever*, *východ*, *jih* a *západ*.

source: Name
cs: Název

source: Terminal uuid.
cs: UUID svorky.
