Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/column_add.po
Languages: cs

source: Add column to title block
cs: Přidání sloupce do záhlaví výkresu

source: QElectroTech `title block editor`_ allows adding `columns`_ from `menu bar`_ and `drawing area`_.
cs: `Editor záhlaví výkresu`_ QElectroTechu umožňuje přidávat `sloupce`_ přes `hlavní nabídku`_ a `kreslicí plochu`_.

source: Add column from menu bar
cs: Přidání sloupce z hlavní nabídky

source: Select **Edit > Add a column** menu item to add a new `column`_ at the right side from the `title block`_.
cs: Pro přidání nového `sloupce`_ po pravé straně `záhlaví výkresu`_ vyberte položku nabídky **Úpravy > Přidat**.

source: Figure: QElectroTech title block editor, edit menu
cs: Obrázek: Nabídka Úpravy editoru záhlaví výkresu v QElectroTechu

source: Adding a new `column`_ at the middle from the `title block`_ can only be done from `drawing area`_.
cs: Přidání nového `sloupce`_ ve středu `záhlaví výkresu`_ může býtprovedeno pouze z `kreslicí plochy`_.

source: Add column from drawing area
cs: Přidání sloupce z kreslicí plochy

source: Right click on the head from the `column`_ next to the position where the new `column`_ should be placed.
cs: Klepněte pravým tlačítkem na záhlaví `sloupce`_ vedle polohy, kdeby se měl umístit nový sloupec.

source: Click the option **Add a column (before)** or **Add a column (after)** to add a new colum before or after the selected `column`_.
cs: Klepněte na volbu **Přidat sloupec (před)** nebo **Přidat sloupec (po)** propřidání nového sloupce před nebo za vybraný `sloupec`_.

source: Figure: QElectroTech title block editor, drawing area
cs: Obrázek: Kreslicí plocha editoru záhlaví výkresu v QElectroTechu
