Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/define_extra_info.po
Languages: cs

source: Define title block extra information
cs: Stanovení dalších informací o záhlaví výkresu

source: Define extra information from menu bar
cs: Stanovení dalších informací přes hlavní nabídku

source: Select **Edit > Edit extra information** menu item to display `extra information PopUp window`_.
cs: Pro zobrazení `vyskakovacího okna s doplňujícími údaji`_ vyberte položku nabídky **Úpravy > Upravit doplňující údaje**.

source: Figure: QElectroTech title block editor Edit Menu
cs: Obrázek: Nabídka Úpravy editoru záhlaví výkresu v QElectroTechu

source: Introduce the desired information in the text field.
cs: Požadované informace zadejte do textového pole.

source: Press **OK** to accept and close `extra information PopUp window`_.
cs: Stiskněte **OK** pro přijetí a zavření `vyskakovacího okna s doplňujícími údaji`_.

source: Define extra information using keyboard shortcut
cs: Stanovení dalších informací pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + y`` to display the `extra information PopUp window`_.
cs: Stiskněte ``Ctrl + y`` pro zobrazení `vyskakovacího okna s doplňujícími údaji`_.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
