Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/row_add.po
Languages: cs

source: Add row to title block
cs: Přidání řádku do záhlaví výkresu

source: QElectroTech `title block editor`_ allows adding `row`_ from `menu bar`_ and `drawing area`_.
cs: `Editor záhlaví výkresu`_ QElectroTechu umožňuje přidávat `řádky`_ přes `hlavní nabídku`_ a `kreslicí plochu`_.

source: Add row from menu bar
cs: Přidání řádku z hlavní nabídky

source: Select **Edit > Add a row** menu item to add a new `row`_ below.
cs: Pro přidání nového `řádku`_ níže vyberte položku nabídky **Úpravy > Přidat řádek**.

source: Figure: QElectroTech title block editor, edit menu
cs: Obrázek: Nabídka Úpravy editoru záhlaví výkresu v QElectroTechu

source: Adding a new `row`_ at top or middle from `title block`_ can only be done from `drawing area`_.
cs: Přidání nového `řádku`_ nahoře nebo uprostřed `záhlaví výkresu`_ může být provedeno pouze z `kreslicí plochy`_.

source: Add row from drawing area
cs: Přidání řádku z kreslicí plochy

source: Right click on the head from the `row`_ below or above the position where the new `row`_ should be placed.
cs: Klepněte pravým tlačítkem na záhlaví `řádku`_ pod nebo nad polohou, kde by se měl umístit nový `řádek`_.

source: Click the option **Add a row (before)** or **Add a row (after)** to add a new `row`_ above or below the selected `row`_.
cs: Klepněte na volbu **Přidat řádek (před)** nebo **Přidat řádek (po)** pro přidání nového řádku před nebo za vybraný `řádek`_.

source: Figure: QElectroTech title block editor, drawing area
cs: Obrázek: Kreslicí plocha editoru záhlaví výkresu v QElectroTechu
