Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/conductor/type/multiline_conductor.po
Languages: cs

source: Multiline conductor
cs: Vícežilový vodič

source: Multiline conductors are used at `multiline diagrams`_. Multiline conductors are used for the representation of each terminal, line and phase from two and three phase power systems. Multiline conductors are used for the individual representation of all electric and control systems.
cs: Vícežilové vodiče se používají ve `vícežilových diagramech`_. Vícežilovévodiče se používají pro znázornění každé svorky, vedení afáze dvoufázové a třífázové napájecí soustavy. Vícežilové vodiče sepoužívají k samostatnému znázornění všech elektrických a ovládacíchsystémů.

source: At fluid power schemas, a multiline conductor represents each pressure, return and pilote line.
cs: Ve kapalinových energetických výkresech představuje vícežilový vodič každý tlak,zpětný chod a vodicí část.

source: The main difference of multiline with respect to `single line conductors`_ is the posibility to display text which is linked to the `conductor properties`_.
cs: Hlavní rozdíl mezi vícežilovým a `jednožilovýmvodičem`_ je možnost zobrazit text, který je propojen s`vlastnostmi vodiče`_.

source: Figure: Multiline conductor
cs: Obrázek: Vícežilový vodič

source: The main features of multiline conductors are:
cs: Hlavní vlastnosti vícežilových vodičů jsou:

source: Possibility to define properties (Function and voltage/protocol)
cs: Možnost stanovit vlastnosti (funkce a napětí/protokol)

source: Text linked to the conductor which can be displayed and its position is relative to the conductor position.
cs: Text spojený s vodičem, který lze zobrazit, a jeho poloha mávztah k poloze vodiče.

source: Possibility of displaying variables values at the conductor text (Auto numbering, function or voltage/protocol).
cs: Možnost zobrazení hodnot proměnných v textu vodiče (automatickéčíslování, funkce nebo napětí/protokol).

source: Possibility of using the conductor variables at `element dynamic text`_ (Function and voltage/protocol).
cs: Možnost použití proměnných vodičů `dynamickém textu prvku`_(funkce a napětí/protokol).
