Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/conductor/properties/display_conductor_properties.po
Languages: cs

source: Display conductor properties
cs: Zobrazení vlastností vodiče

source: The conductor properties window can be displayed from `menu bar`_, from `workspace`_ and using the corresponding keyboard shortcut.
cs: Okno s vlastnostmi vodiče lze zobrazit přes `hlavní nabídku`_, z`pracovní plochy`_ a pomocí odpovídající klávesové zkratky.

source: Display conductor properties from menu bar
cs: Zobrazení vlastností vodiče přes hlavní nabídku

source: Select the `conductor`_ which `properties`_ should be displayed.
cs: Vyberte `vodič`_, jehož `vlastnosti`_ se mají zobrazit.

source: Select **Edit > Edit conductor** menu item to display the conductor properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi vodiče vyberte položku nabídky **Úpravy > Upravit vodič**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Display conductor properties from workspace
cs: Zobrazení vlastností vodiče z pracovní plochy

source: Right click on the `conductor`_ which `properties`_ should be displayed.
cs: Klepněte pravým tlačítkem myši na `vodič`_, jehož `vlastnosti`_ se mají zobrazit.

source: Select **Edit conductor** option to display the conductor properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi vodiče vyberte volbu **Upravit vodič**.

source: Figure: QElectroTech conductor options
cs: Obrázek: Volby pro vodič v QElectroTechu

source: Display conductor properties using keyboard shortcut
cs: Zobrazení vlastností vodiče pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the conductor properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi vodičestiskněte ``Ctrl + e``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
