Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/picture.po
Languages: cs

source: Working with pictures
cs: Práce s obrázky

source: QElectroTech allows adding and working with pictures at `folios`_. The format from the picture should be **PNG**, **JPG**, **JPEG**, **SVG** or **Bitmap**.
cs: QElectroTech umožňuje přidávání a práci s obrázky v `listech`_.Formát obrázku má být **PNG**, **JPG**, **JPEG**, **SVG** nebo**bitmapa**.

source: Figure: Cover Arduino project
cs: Obrázek: Obal projektu Arduino

source: Add picture
cs: Přidat obrázek

source: Select the icon |insert-image| from `toolbar`_ to open the search file PopUP window.
cs: Pro otevření vyskakovacího okna pro hledání souboru vyberte ikonu |insert-image| v `pruhu s nástroji`_

source: Select the picture at the corresponding directory.
cs: Vyberte obrázek v příslušném adresáři.

source: Press **Open** button to add the picture.
cs: Pro přidání obrázku stiskněte tlačítko **Otevřít**.

source: Left click on the `workspace`_ area where the picture should be placed.
cs: Klepněte levým tlačítkem myši na oblast v `kreslicí ploše`_, kde se má obrázek umístit.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Add**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Přidání**.

source: Resize picture
cs: Změna velikosti obrázku

source: Right click on the picture.
cs: Klepněte pravým tlačítkem myši na obrázek.

source: Select the option **Edit the image** to display the picture editor.
cs: Vyberte volbu **Upravit obrázek** pro zobrazení editoru obrázku.

source: Choose the size scale desired.
cs: Vyberte požadované velikostní měřítko.

source: Press **Apply** button to change the picture size.
cs: Pro změnu velikosti obrázku stiskněte tlačítko **Použít**.

source: Figure: QElectroTech picture editor
cs: Obrázek: Editor obrázku v QElectroTechu

source: The picture editor can also be displayed with double click on the picture using ``Ctrl + e`` shortcut keyboard.
cs: Editor obrázků lze zobrazit také dvojitým klepnutím na obrázekpomocí klávesové zkratky ``Ctrl + e``.

source: Move picture
cs: Přesunutí obrázku

source: Left click on the picture.
cs: Klepněte levým tlačítkem myši na obrázek.

source: Move the picture without releasing the button.
cs: Přesuňte obrázek bez uvolnění levého tlačítka myši.

source: The position from the picture can be locked to prevent involuntary movements, go to picture editor and check the **Lock Position** button.
cs: Polohu obrázku lze uzamknout, aby se zabránilo nechtěnýmpohybům. Přejděte do editoru obrázků a zaškrtněte tlačítko **Zamknout polohu**.
