Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/rotate.po
Languages: cs

source: Rotate object
cs: Otočení předmětu

source: QElectroTech allows choosing the orientation from many object which are represented at the `folio`_. The objects which orientation can be choosed are the following:
cs: QElectroTech umožňuje zvolit natočení mnoha předmětů, které jsouznázorněny v `listu`_. Předměty, jejichž natočení lze vybrat,jsou následující:

source: `Element`_
cs: `Prvek`_

source: `Picture`_
cs: `Obrázek`_

source: `Text field`_
cs: `Textové pole`_

source: QElectroTech does not allow all orientations for the objects mentioned before, only 4 different orientations are possible: **0**, **90**, **180** and **270** degrees.
cs: QElectroTech neumožňuje všechna natočení výše uvedených předmětů.Jsou možné pouze 4 různá natočení: **0**, **90**,**180** a **270** stupňů.

source: QElectroTech only offers the posibility to rotate **90** degress on the clock direction.
cs: QElectroTech nabízí pouze možnost otáčení **90** stupňů posměru hodinových ručiček.

source: To rotate **180** degrees the actions should be repited once.
cs: Pro otočení o **180** stupňů je třeba krok opakovat jednou.

source: To rotate **270** degrees the actions should be repited twice.
cs: Pro otočení o **270** stupňů je třeba krok opakovat dvakrát.

source: Multiples objects can be rotated at the same time `selecting multiples object`_
cs: Ve stejnou dobu lze po `vybrání více předmětů`_ otočit více předmětů

source: Rotating objects can be done from `menu bar`_, `toolbar`_, by right click on the object and using the corresponding keyboard shortcut.
cs: Otáčení předmětů lze provádět přes `hlavní nabídku`_, `panel nástrojů`_, klepnutím pravým tlačítkem na předmět a pomocí odpovídající klávesové zkratky.

source: Rotate object from menu bar
cs: Otočení předmětu přes hlavní nabídku

source: `Select the object`_ which should be rotated.
cs: `Vyberte předmět(y)`_, který se má otočit.

source: Select **Edit > Rotate** menu item to rotate the object.
cs: Pro vyjmutí předmětu vyberte položku nabídky **Úpravy > Otočit**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Rotate object from toolbar
cs: Otočení předmětu přes pruh s nástroji

source: Select the icon |transform-rotate| from `toolbar`_ to rotate the object.
cs: Pro otočení předmětu v `panelu nástrojů`_ vyberte ikonu |transform-rotate|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Nástroje**.

source: Rotate object by right click
cs: Otočení předmětu klepnutím pravým tlačítkem myši

source: Right click on the object which should be rotated.
cs: Klepněte pravým tlačítkem myši na předmět, který se má otočit.

source: Select the option **Rotate** to delete the object.
cs: Pro smazání předmětu vyberte volbu **Otočit**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Rotate object using keyboard shortcut
cs: Otočení předmětu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Space`` to rotate the object.
cs: Pro otočení předmětu stiskněte ``mezerník``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
