Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/search.po
Languages: cs

source: Search
cs: Hledání

source: To find information inside a `schema`_ easily, QElectroTech provides a searching feature. This feature allows finding automatically `folios`_, `elements`_, `conductors`_ and `text fields (plain text)`_ which contains a string at one of the properties.
cs: Pro snadné vyhledání informací uvnitř `výkresu`_ poskytuje QElectroTechfunkci vyhledávání. Tato funkce umožňuje automaticky najít `listy`_,`prvky`_, `vodiče`_ a `textová pole (prostý text)`_, které obsahujířetězec v jedné z vlastností.

source: To find an object which contains a string:
cs: Pro nalezení předmětu, který obsahuje informace:

source: Go to `search menu`_.
cs: Jděte do `vyhledávací nabídky`_.

source: Figure: QElectroTech search menu
cs: Obrázek: Nabídka pro vyhledávání v QElectroTechu

source: Write the string which should be search over the `project`_ in the text box from the menu.
cs: Do textového pole z nabídky napište řetězec, který se má hledat přes `projekt`_.

source: Press ``Intro`` and QElectroTech will zoom and display the first object from the list of matches at the `workspace`_.
cs: Stiskněte ``Intro`` a QElectroTech přiblíží a zobrazí první předmětze seznamu nálezů v `pracovní ploše`_.

source: Press |icon_next| or |icon_previous| button to zoom the next or previous object from the list of matches.
cs: Stiskněte tlačítko |icon_next| nebo |icon_previous| pro přiblížení dalšího nebo předchozíhopředmětu v seznamu nálezů.

source: Press |icon_actualize| button to refresh the search.
cs: Pro obnovení vyhledávání stiskněte tlačítko |icon_actualize|.

source: If the `search menu`_ is not displayed, it can be displayed from **Edit > Search / Replace** menu item or using ``Ctrl + f`` shortcut keyboard.
cs: Pokud se `nabídka vyhledávání`_ nezobrazí, lze ji zobrazit přes položku nabídky ** Úpravy >Hledat/Nahradit** nebo pomocí klávesové zkratky ``Ctrl + f``.

source: QElectrotech provides also some advanced properties for searching. Before searching, a filter can be dedined to reduce the list of matches according the following criteria:
cs: QElectrotech poskytuje také některé pokročilé vlastnosti pro vyhledávání. Před vyhledáváním lze stanovit filtr, který zmenší seznam nálezůpodle následujících hledisek:

source: `Text fields (Plain text)`_.
cs: `Textová pole (prostý text)`_.

source: Whole words (`Text fields (Plain text)`_, `Conductor properties`_, `Element properties`_, `Folio properties`_)
cs: Celá slova (`textová pole (prostý text)`_, `vlastnosti vodiče`_, `vlastnosti prvku`_, `vlastnosti listu`_)

source: To create an advanced search:
cs: Pro vytvoření pokročilého vyhledávání:

source: Press |icon_advanced| button to display the filter tree.
cs: Pro zobrazení stromu filtru stiskněte tlačítko |icon_advanced|.

source: Figure: QElectroTech advanced search menu
cs: Obrázek: Nabídka pro pokročilé vyhledávání v QElectroTechu

source: Select the type of text to be searched (**Plain text** or **Whole words**) at the combobox from the right side of the text box.
cs: Vyberte typ prohledávaného textu (**Prostý text** nebo **Celáslova**) v rozbalovacím seznamu na pravé straně textového pole.

source: Click / unclick the button which selects **Case sensitive**.
cs: Klepněte na tlačítko, které vyberte **Rozlišovat velká a malá písmena**.

source: From here, follow the steps from the standard search.
cs: Odtud postupujte podle pokynů pro běžné vyhledávání.
