Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/annex/color.po
Languages: cs

source: Color selection
cs: Výběr barvy

source: Basic color
cs: Základní barva

source: QElectroTech provides a **Select color** PopUp window with some basic colors.
cs: QElectroTech poskytuje vyskakovací okno **Vybrat barvu** s některými základními barvami.

source: Figure: QElectroTech basic color selector
cs: Obrázek: Volič základní barvy v QElectroTechu

source: To select a color:
cs: Pro vybrání barvy:

source: Click on the desired color.
cs: Klepněte levým tlačítkem myši na požadovanou barvu.

source: Press **Select** button.
cs: Stiskněte tlačítko **Vybrat**.

source: The **Select color** PopUp window is also provided with a custom section where the colors defined in the past are stored.
cs: Vyskakovací okno **Vybrat barvu** je také vybaveno vlastní částí, kde jsou uloženy barvy stanovené v minulosti.

source: Custom color
cs: Vlastní barva

source: QElectroTech allows customizing colors by defining the HTML code.
cs: QElectroTech umožňuje přizpůsobení barev pomocí stanovení kódu HTML.

source: To define a custom color:
cs: Pro stanovení vlastní barvy:

source: Press the buttom + from the custom color section of the **Select color** PopUp window.
cs: Stiskněte tlačítko + v části s vlastní barvou vyskakovacího okna **Vybrat barvu**.

source: Define the HTML code of the desired color in the text box.
cs: V textovém poli stanovte kód HTML požadované barvy.

source: Figure: QElectroTech custom color selector
cs: Obrázek: Volič vlastní barvy v QElectroTechu

source: Press **Select** button to add the new color to the custom section of the **Select color** PopUp window.
cs: Stiskněte tlačítko **Vybrat** pro přidání nové barvy do části s vlastní barvou vyskakovacího okna **Vybrat barvu**.

source: The custom color can also be defined visually:
cs: Vlastní barvu lze stanovit také zrakem:

source: The color scale can be defined by the scrollbar placed at left side.
cs: Barevnou stupnici lze stanovit posuvníkem umístěným na levé straně.

source: The grays scale can be defined by a cursor click on the color scale.
cs: Stupnici šedi lze stanovit klepnutím ukazovátkem na barevnou stupnici.

source: For more information about HTML color code, refer to online resources as:
cs: Další informace o barvách v kódu HTML najdete na internetu v:
