Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/annex/variables.po
Languages: cs

source: Default QElectroTech variables
cs: Výchozí proměnné v QElectroTechu

source: To systematize title block templates and allow auto numbering of elements, conductors and folios; QElectroTech provides the posibility to work with variables.
cs: Pro soustavné uspořádání vzorů záhlaví výkresů a povolení automatického číslováníprvků, vodičů a listů QElectroTech poskytuje možnost práce s proměnnými.

source: The variables are used to define the content of text field and properties from elements, folios and conductors. Depending on the conditions during the creation of the object (folio, element, conductor, etc,) The variable of the text or property field is replaced by a different value.
cs: Proměnné se používají ke stanovení obsahu textového pole a vlastnostíprvků, listů a vodičů. V závislosti na podmínkách běhemvytvoření předmětu (list, prvek, vodič atd.)proměnná textu nebo pole vlastnosti je nahrazena jinou hodnotou.

source: A property is identified as a string which starts with the symbol **%**. The default variables provided by ElectroTech can be found at this section.
cs: Vlastnost je určena jako řetězec, který začíná symbolem **%**.Výchozí proměnné poskytované QElectroTechem najdete v této části.

source: General project variables
cs: Obecné proměnné projektu

source: The following variables are global variables which can be used to create title block templates.
cs: Následující proměnné jsou celkové proměnné. Mohouse použít k vytvoření vzorů záhlaví výkresů.

source: **% {projecttitle}**: Project title
cs: **% {projecttitle}**: Název projektu

source: **% {projectpath}**: Project path
cs: **% {projectpath}**: Cesta k projektu

source: **% {projectfilename}**: Project file name
cs: **% {projectfilename}**: Název souboru projektu

source: **% {saveddate}**: File saving date
cs: **% {saveddate}**: Datum uložení souboru

source: **% {filename}**: Project file name
cs: **% {filename}**: Název souboru projektu

source: **% {savedfilename}**: Registered file name
cs: **% {savedfilename}**: Název zapsaného souboru

source: **% {savedfilepath}**: Saved file path
cs: **% {savedfilepath}**: Cesta k uloženému souboru

source: **% {savedtime}**: File saving time
cs: **% {savedtime}**: Čas uložení souboru

source: **% {folio-total}**: Total number of folios in the project
cs: **% {folio-total}**: Celkový počet listů v projektu

source: **% {version}**: Software version
cs: **% {version}**: Verze programu

source: **% {machine}**: Project functional group name
cs: **% {machine}**: Název funkční skupiny projektu

source: variables related to folio
cs: Proměnné související s listem

source: The following variables are specific variables for each folio. They can be used to create title block templates.
cs: Následující proměnné jsou zvláštní proměnné pro každý list. Mohouse použít k vytvoření vzorů záhlaví výkresů.

source: **% {folio-id}**: Folio position in the project
cs: **% {folio-id}**: Poloha listu v projektu

source: **% {title}**: Folio title
cs: **% {title}**: Název listu

source: **% {author}**: Folio author
cs: **% {author}**: Autor listu

source: **% {date}**: Folio date
cs: **% {date}**: Datum listu

source: **% {folio}**: Folio information (Label)
cs: **% {folio}**: Informace o listu (popis)

source: **% {indexrev}**: Folio revision index
cs: **% {indexrev}**: Číslo změny listu

source: **% {locmach}**: Name of the location in the project functional group
cs: **% {locmach}**: Název umístění ve funkční skupině projektu

source: **% {previous-folio-num}**: Number previous folio
cs: **% {previous-folio-num}**: Číslo předchozího listu

source: **% {next-folio-num}**: Number next folio
cs: **% {next-folio-num}**: Číslo dalšího listu

source: variables related to element
cs: Proměnné související s prvkem

source: The following variables are specific variables for each element. They can be used to create auto numbering patterns.
cs: Následující proměnné jsou zvláštní proměnné pro každý prvek. Mohouse použít k vytvoření vzorů automatického číslování.

source: **% {F}**: Label from the folio where the element can be found
cs: **% {F}**: Štítek listu, kde lze prvek najít

source: **% {f}**: Number from the folio where the element can be found
cs: **% {f}**: Číslo listu, kde lze prvek najít

source: **% {M}**: Plant variable from the folio where the element can be found
cs: **% {M}**: Proměnná instalace v listu, kde lze prvek najít

source: **% {LM}**: Location variable of the folio where the element can be found
cs: **% {LM}**: Proměnná umístění listu, kde lze prvek najít

source: **% {l}**: Folio line number from the workspace where the element can be found
cs: **% {l}**: Číslo řádku listu pracovní plochy, kde lze prvek najít

source: **% {c}**: Folio column number from the workspace where the element can be found
cs: **% {c}**: Číslo sloupce listu pracovní plochy, kde lze prvek najít

source: **% {id}**: Folio position in the project (Schema number)
cs: **% {id}**: Poloha listu v projektu (číslo výkresu)

source: variables related to conductor
cs: Proměnné související s vodičem

source: The following variables are specific variables for each conductor. They can be used to create auto numbering patterns.
cs: Následující proměnné jsou zvláštní proměnné pro každý vodič. Mohouse použít k vytvoření vzorů automatického číslování.

source: **% {F}**: Label from the folio where the conductor can be found
cs: **% {F}**: Štítek listu, kde lze vodič najít

source: **% {f}**: Number from the folio where the conductor can be found
cs: **% {f}**: Číslo listu, kde lze vodič najít

source: **% {M}**: Plant variable from the folio where the conductor can be found
cs: **% {M}**: Proměnná instalace v listu, kde lze vodič najít

source: **% {LM}**: Location variable of the folio where the conductor can be found
cs: **% {LM}**: Proměnná umístění listu, kde lze vodič najít

source: **% {l}**: Folio line number from the workspace where the conductor can be found
cs: **% {l}**: Číslo řádku listu pracovní plochy, kde lze vodič najít

source: **% {c}**: Folio column number from the workspace where the conductor can be found
cs: **% {c}**: Číslo sloupce listu pracovní plochy, kde lze vodič najít
