Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/properties/define_element_author.po
Languages: cs

source: Define author element information
cs: Stanovení údajů o autorovi prvku

source: Define author element information from menu bar
cs: Stanovení údajů o autorovi prvku přes hlavní nabídku

source: Select **Edit > Edit author information** menu item to display the `author information PopUp window`_.
cs: Pro zobrazení `vyskakovacího okna s údaji o autorovi`_ vyberte položku nabídky **Úpravy > Upravit údaje o autorovi**.

source: Figure: QElectroTech element editor Edit Menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Introduce the desired information to the text box.
cs: Požadované informace zadejte do textového pole.

source: Press the button **OK** to accept and close the `author information PopUp window`_.
cs: Pro přijetí a zavření `vyskakovacího okna s údaji o autorovi`_ stiskněte tlačítko **OK**.

source: Define author element information using keyboard shortcut
cs: Stanovení údajů o autorovi prvku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + y`` to display the `author information PopUp window`_.
cs: Stiskněte ``Ctrl + Y`` pro zobrazení `vyskakovacího okna s údaji`_ o autorovi prvku.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
