Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/properties/edit_element_prop.po
Languages: cs

source: Edit element properties
cs: Upravení vlastností prvku

source: Edit element properties from menu bar
cs: Upravení vlastností prvku přes hlavní nabídku

source: Select **Edit > Edit element properties** menu item to display the element properties PopUp window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi prvku vyberte položku nabídky **Úpravy > Upravit vlastnosti prvku**.

source: Figure: QElectroTech element editor Edit Menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Select the `element family`_, the base type from the `element`_, at **Type** tab.
cs: Vyberte `rodinu prvku`_, základní typ `prvku`_, v kartě **Typ**.

source: Figure: QElectroTech element properties **Type** tab
cs: Obrázek: Karta **Typ** ve vlastnostech prvku v QElectroTechu

source: For `simple`_, `master`_ or `terminal block`_ elements:
cs: Pro prvky `jednoduchý`_, `nadřízený`_ nebo `svorkovnice`_:

source: Go to **Informations** tab.
cs: Jděte na kartu **Informace**.

source: Figure: QElectroTech element properties Information tab
cs: Obrázek: Karta **Informace** ve vlastnostech prvku v QElectroTechu

source: Fill each predefined field with the desired information.
cs: Vyplňte každé předem stanovené pole požadovanými údaji.

source: Press the button **OK** to accept and close the element properties PopUp window.
cs: Pro přijetí a zavření vyskakovacího okna s vlastnostmi prvku stiskněte tlačítko **OK**.

source: For `slave`_ or `reference folio`_ elements:
cs: Pro prvky `podřízený`_ nebo `odkaz na list`_:

source: Edit element properties from toolbar
cs: Upravení vlastností prvku přes pruh s nástroji

source: Press the icon |element-edit| from `toolbar`_ to display the element properties PopUp window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi prvku v `panelu nástrojů`_stiskněte ikonu |element-edit|.

source: Follow same procedure defined at the previous section starting from step 2.
cs: Následujte stejný postup, který je stanoven v předchozí části, počínaje krokem2.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Element**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Prvek**.
