Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/properties/edit_element_name.po
Languages: cs

source: Define element name
cs: Stanovení názvu prvku

source: The element name is used to identify the `element`_ at QElectroTech. The name has no relation with the element file name, they can be completely different. The name file is the name from the file which contains the information from the `element`_. The element name is the name which represents the `element`_ in the different collection.
cs: Název prvku se používá k rozpoznání `prvku`_ v QElectroTechu. Název nemá žádnou souvislost s názvem souboru prvku. Mohou být zcela odlišné. Pojmenovaný soubor je název ze souboru, který obsahuje informace o `prvku `_. Název prvku je název, který představuje `prvek`_ v jiné sbírce.

source: The element name can be defined in many different languages. Depending on the chosen language at QElectroTech settings, the name is displayed for the user at one language or at another.
cs: Název prvku lze stanovit v mnoha různých jazycích. V závislosti na jazyku zvoleném v nastavení QElectroTechu se pro uživatele název zobrazí v jednom nebo v jiném jazyce.

source: Figure: QElectroTech element name PopUP window
cs: Obrázek: Vyskakovací okno pro název prvku v QElectroTechu

source: QElectroTech works according `ISO 639-1`_ norm. The text language is defined using 2 letters code which should be used at the **Language** column from the cell value table.
cs: QElectroTech pracuje podle normy `ISO 639-1`_. Jazyk textu je stanoven pomocí dvojpísmenného kódu, který se má použít ve sloupci **Jazyk** tabulky hodnot buňky.

source: Define element name from menu bar
cs: Stanovení názvu prvku přes hlavní nabídku

source: Select **Edit > Edit name and information of the element** menu item to display the name editor PopUp window.
cs: Pro zobrazení vyskakovacího okna editoru názvu vyberte položku nabídky **Úpravy > Upravit název a informace o prvku**.

source: Figure: QElectroTech element editor Edit Menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Press the button **+ Add a line** to introduce a new row at the element name table.
cs: Stiskněte tlačítko **+ Přidat řádek** pro přidání nového řádku do tabulky s názvem prvku.

source: Define the 2 letters code language at **Language** column.
cs: Stanovte dvojpísmenný kód ve sloupci **Jazyk**.

source: Define the element name with the defined language at **Text** column.
cs: Stanovte název prvku se stanoveným jazykem ve sloupci **Text**.

source: Press the button **OK** to accept and close the name editor PopUp window.
cs: Pro přijetí a zavření vyskakovacího okna editoru názvu stiskněte tlačítko **OK**.

source: Define element name from toolbar
cs: Stanovení názvu prvku přes pruh s nástroji

source: Press the icon |names| from the `toolbar`_ to display the name editor PopUp window.
cs: Pro zobrazení vyskakovacího okna editoru názvu v `panelu nástrojů`_ stiskněte ikonu |names|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Element**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Prvek**.

source: Define element name using keyboard shortcut
cs: Stanovení názvu prvku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the name editor PopUp window.
cs: Pro zobrazení vyskakovacího okna editoru názvu stiskněte ``Ctrl + E``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
