Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/element_size.po
Languages: cs

source: Change element size
cs: Změna velikosti prvku

source: QElectroTech provide the feature of changing the size of the graphical symbol from an `element`_. This feature is equivalent to the scale feature from CAD tools and graphical vector editors.
cs: QElectroTech poskytuje funkci změny velikosti výkresové značky`prvku`_. Tato funkce odpovídá funkci pro měřítko nástrojů CAD a grafických vektorových editorů.

source: The current version from QElectroTech, version 0.7, does not provide the option of defining the proportion to scale.
cs: Nynější verze QElectroTechu, verze 0.7, neumožňuje stanovit poměr k měřítku.

source: To changee the size from element symbol:
cs: Pro změnu velikosti značky prvku:

source: Open the `element`_ desired using the `element editor`_.
cs: Pro otevření požadovaného `prvku`_ v `editoru prvku`_.

source: `Select all element parts`_ from `workspace`_.
cs: `Vyberte všechny části prvku`_ z `pracovní plochy`_.

source: Press one of the control points from the global element symbol rectangle (green points from the figure).
cs: Stiskněte jeden z řídicích bodů obdélníku symbolu globálního prvku(zelené body na obrázku).

source: Figure: QElectroTech element editor workspace
cs: Obrázek: Pracovní plocha editoru prvku v QElectroTechu

source: Move the point without releasing the left button of the mouse.
cs: Přesuňte bod bez uvolnění levého tlačítka myši.

source: Once the element symbol has been scaled, `save changes`_ and `close element editor`_.
cs: Po změně měřítka symbolu prvku `uložte změny`_ a `zavřete editor prvku`_.
