Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/properties/general_prop.po
Languages: cs

source: General properties
cs: Obecné vlastnosti

source: The general properties section from `project properties`_ PopUP windows is the area where the user can define global project variables that later on can be used at the `folios title block templates`_ to automate the filling of the `title block`_.
cs: Část s obecnými vlastnostmi ve vyskakovacích oknech s `vlastnostmi projektu`_je oblast, kde může uživatel stanovit celkové proměnné projektu, které lze později použít ve `vzorech záhlaví výkresu listů`_ k automatizacivyplnění `záhlaví výkresu`_.

source: Creating general project variables is recomended, it increases the working efficiency. The variables that can be found by default are:
cs: Doporučuje se vytvoření obecných projektových proměnných, což zvyšujeúčinnost práce. Ve výchozím nastavení lze najít proměnné:

source: **% {projecttitle}**: Project title
cs: **% {projecttitle}**: Název projektu

source: **% {saveddate}**: File saving date
cs: **% {saveddate}**: Datum uložení souboru

source: **% {savedfilename}**: Registered file name
cs: **% {savedfilename}**: Název zapsaného souboru

source: **% {savedfilepath}**: Saved file path
cs: **% {savedfilepath}**: Cesta k uloženému souboru

source: **% {savedtime}**: File saving time
cs: **% {savedtime}**: Čas uložení souboru

source: Figure: General project properties window
cs: Obrázek: Okno s obecnými vlastnostmi projektu

source: To create a new project variable:
cs: Pro vytvoření proměnné nového projektu:

source: `Display project properties`_ PopUp window.
cs: Vyskakovací okno pro `zobrazení vlastností projektu`_.

source: Go to **General** project properties section.
cs: Jděte do části s vlastnostmi projektu **Obecné**.

source: Define the variable name at the left cell from the last row of the project variables table.
cs: Stanovte název proměnné v levé buňce posledního řádkutabulky s proměnnými projektu.

source: Define the value of the variable at the right cell from the variable row.
cs: Stanovte hodnotu proměnné v pravé buňce řádku s proměnnou.

source: Press the button **OK** to save the changes and close the PopUp window.
cs: Pro uložení změn a zavření vyskakovacího okna stiskněte tlačítko **OK**.

source: For more information about QElectroTech default variables, refer to `default QElectroTech variables`_ section.
cs: Další informace o výchozích proměnných QElectroTechu najdete v části k `proměnným v QElectroTechu`_.
