Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/default_collection.po
Languages: cs

source: QET collection
cs: Sbírka QET

source: The QET collection is the default collection from QElectroTech. This collection is protected and the user can only read it, the QET collection cannot be edited. The user cannot add any `element`_, any category or sub-category and cannot re-organize the `elements`_ in the database.
cs: Sbírka QET je výchozí sbírka v QElectroTechu. Tatosbírka je chráněna a uživatel ji může pouze číst. Sbírku QETnelze upravit. Uživatel nemůže přidávat ani mazat `prvky`_ v databázi.

source: Figure: QET collection tree at collection panel
cs: Obrázek: Strom sbírky QET v panelu se sbírkou

source: The QET collection has the following categories:
cs: Sbírka QET má následující skupiny:

source: Electric
cs: Elektrická

source: Collection of electrical components (motors, converters, switches, electrical protections, etc.)
cs: Sbírka elektrických součástí (motory, měniče, spínače,elektrické ochrany atd.)

source: Logic
cs: Logická

source: Logic signal symbols (AND, OR, NOT, NOR, etc.), Grafcet symbols, Ladder symbols and flow char symbols.
cs: Symboly logických signálů (AND, OR, NOT, NOR atd.), symboly Grafcet, symboly žebříkua symboly pro výrobní výkresyr.

source: Hydraulic
cs: Kapalinová

source: Collection of hydraulic components (Pumps, cylinders, pressure limit valves, pressure relief valves, directional valves, etc.)
cs: Sbírka hydraulických součástí (čerpadla, válce, ventily tlakových mezí, přetlakové ventily, směrové ventily atd.)

source: Pneumatic
cs: Vzduchová

source: Collection of hydrualic components (Compressor, cylinders, air filters, directional valves, etc.)
cs: Sbírka hydraulických součástí (kompresor, válce, vzduchové filtry,směrové ventily atd.)

source: Energy
cs: Energie

source: Collection of elements used at the energy field (pumps, turbines, solar panels, heat exchangers, etc.)
cs: Sbírka prvků používaných na poli energie (čerpadla, turbíny, solárnípanely, výměníky tepla atd.)
