Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/delete_folder.po
Languages: cs

source: Delete category
cs: Smazání skupiny

source: Working with collections can only be done from `collections panel`_.
cs: Práce se sbírkami lze provádět pouze v `panelu se sbírkami`_.

source: Select **Settings > Display > Collections** menu item to display the `collections panel`_.
cs: Pro zobrazení `panelu se sbírkami`_ vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.

source: QElectroTech allows deleting categories from some collection. The user has only read rights at QET element collection, the user can delete categories from all collections except QET collection.
cs: QElectroTech umožňuje smazání skupin v některé ze sbírek. Uživatel si mápouze přečíst práva pro sbírku prvků QET. Uživatel může skupiny smazatve všech sbírkách kromě sbírky QET.

source: Right click on the category / sub-category from the collection that should be deleted.
cs: Klepněte pravým tlačítkem na skupinu/podskupinuve sbírce, která se má smazat.

source: Figure: Options at folder
cs: Obrázek: Volby pro složku

source: Click the option **Delete folder** to delete the category / sub-category.
cs: Pro smazání skupiny/podskupiny klepněte na volbu **Smazat složku**.

source: A PopUP confirmation window will be displayed, press **OK** to confirm and delete the category / sub-category.
cs: Bude zobrazeno vyskakovací okno. Pro potvrzení a smazání skupiny/podskupiny stiskněte **OK**.

source: Figure: Deleting PopUP window confirmation
cs: Obrázek: Vyskakovací okno pro potvrzení smazání

source: Be sure about what should be deleted, the category / sub-category and all elements will be deleted from the collection and file system.
cs: Buďte si jistí tím, co se má smazat. Skupina/podskupina a všechny prvky budou odstraněny ze sbírky a ze systému souborů.
