Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/properties_folder.po
Languages: cs

source: Folder properties
cs: Vlastnosti složky

source: At QElectroTech folder and category are the same. The properties from a folder are:
cs: Složka a skupina QElectroTech jsou stejné. Vlastnosti složky jsou:

source: Number of elements in the folder.
cs: Počet prvků ve složce.

source: Number of sub-folders (sub-categories) in the folder.
cs: Počet podsložek (podskupin) ve složce.

source: Internal QElectroTech collection path from the folder.
cs: Cesta složky ve vnitřní sbírce QElectroTechu.

source: File system path from the folder.
cs: Cesta složky v systému souborů.

source: Working with collections can only be done from `collections panel`_.
cs: Práce se sbírkami lze provádět pouze v `panelu se sbírkami`_.

source: Select **Settings > Display > Collections** menu item to display the `collections panel`_.
cs: Pro zobrazení `panelu se sbírkami`_ vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.

source: Right click on the category (folder) from the collection whose properties should be displayed.
cs: Klepněte pravým tlačítkem na skupinu (složku) ve sbírce, jejíž vlastnosti se mají zobrazit.

source: Figure: Options at folder
cs: Obrázek: Volby pro složku

source: Click the option **Folder properties** to display the PopUP window which shows the folder properties.
cs: Pro zobrazení vyskakovacího okna, které zobrazuje vlastnosti složky, klepněte na volbu **Vlastnosti složky**.

source: Figure: Folder properties PopUP window
cs: Obrázek: Vyskakovací okno s vlastnostmi složky v QElectroTechu
