Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/panels/projects_panel.po
Languages: cs

source: Projects panel
cs: Panel s projekty

source: The projects panel displays the opened projects trees, `folios`_ and `embedded title blocks`_. The `QET`_ and `user`_ collection title blocks are also displayed at the projects panel.
cs: Panel s projekty zobrazuje stromy otevřených projektů, `listy`_ a `vložená záhlaví výkresu`_. Záhlaví sbírek `QET`_ a `vlastní`_ se zobrazují také v panelu projektů.

source: Figure: QElectroTech Projects panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: To display or hidden the projects panel:
cs: Pro zobrazení nebo skrytí panelu s projekty:

source: Select **Settings > Display > Projects** menu item.
cs: Vyberte položku nabídky **Nastavení > Zobrazení > Projekty**.

source: The tasks which can be done from projects panel are:
cs: Úkoly, které lze provést z panelu s projekty, jsou:

source: Manage `folios`_ (Add folios, define folio order at each project, etc.).
cs: Spravovat `listy`_ (přidat listy, určit pořadí listů u každého projektu atd.).

source: Manage the `embedded title blocks`_ from the project.
cs: Spravovat `vložená záhlaví výkresu`_ projektu.

source: Manage the default `QET`_ title block collection.
cs: Spravovat výchozí sbírku záhlaví výkresu `QET`_.

source: Manage the `user`_ title block collection.
cs: Spravovat `vlastní`_ sbírku záhlaví výkresu.

source: Define the active project.
cs: Stanovit činný projekt.

source: Define the active folio which should be displayed at the `workspace`_.
cs: Stanovit činný list, který se má zobrazit v `pracovní ploše`_.

source: Display the folio properties PopUP window.
cs: Zobrazit vyskakovací okno s vlastnostmi listu.

source: Display the project properties PopUP window.
cs: Zobrazit vyskakovací okno s vlastnostmi projektu.

source: To make easier the work with the project panel, QElectroTech provides a filter. All `folios`_, `projects`_ and `title blocks`_ without a name or part of a string can be hidden.
cs: Pro usnadnění práce s projektovým panelem nabízí QElectroTech filtr. Všechny `listy`_, `projekty`_ a `záhlaví výkresu`_ bez názvu nebo část řetězce mohou být skryty.
