Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/elements/cell.po
Languages: cs

source: Cell
cs: Buňka

source: Definition
cs: Popis

source: A cell from the `title block`_ is the most basic storage unit avaliable. The three different type of cells are: empty cell, text cell and logo cell.
cs: Buňka v `záhlaví výkresu`_ je nejzákladnější dostupnou úložnou jednotkou. Tři různé typy buněk jsou: prázdná buňka, textová buňka a buňka s logem.

source: Empty cell
cs: Prázdná buňka

source: An empty cell is used when the area occupied by the cell should be empty and without any edge displayed. This type of cell has no properties.
cs: Prázdná buňka se používá, když by oblast obsazená buňkou měla být prázdná a bez jakékoli zobrazené hrany. Tento typ buňky nemá žádné vlastnosti.

source: Figure: QElectroTech title block empty cell properties
cs: Obrázek: Vlastnosti prázdné buňky v záhlaví výkresu v QElectroTechu

source: Text cell
cs: Textová buňka

source: An text cell is used when the area occupied by the cell should be filled by string information inside a rectangle. This type of cell has different parameters that can be defined.
cs: Textová buňka se používá, když oblast obsazená buňkou má být vyplněna informací řetězce uvnitř obdélníku. Tento typ buňky má jiné parametry, které lze stanovit.

source: Figure: QElectroTech title block text cell properties
cs: Obrázek: Vlastnosti buňky v záhlaví výkresu v QElectroTechu

source: Name
cs: Název

source: Name from cell
cs: Název z buňky

source: Label
cs: Štítek

source: When the cell should display a variable from the folio or project properties, the label is the text that appears before the variable.
cs: Kdy má buňka zobrazit proměnnou z vlastností listu nebo projektu, štítek je text, který se objeví před proměnnou.

source: It can be a simple string defined by the user or a variable from the folio or project (Ex: Author, Revision, Date, project name, folio page, etc.).
cs: Může to být jednoduchý řetězec stanovený uživatelem nebo proměnná z listu nebo projektu (příklad: autor, revize, datum, název projektu, stránka listu, atd.).

source: Font
cs: Písmo

source: Font from the label and text of the cell.
cs: Písmo ze štítku a textu buňky.

source: Alignment
cs: Zarovnání

source: Vertical and horizontal position of the label and text from the cell inside the cell.
cs: Svislá a vodorovná poloha štítku a textu buňky uvnitř buňky.

source: Logo cell
cs: Buňka s logem

source: A logo cell is used when the area occupied by the cell should be filled by a picture inside a rectangle. This type of cell has different parameters that can be defined.
cs: Buňka s logem se používá, když má být oblast obsazená buňkou vyplněna obrázkem uvnitř obdélníku. Tento typ buňky má jiné parametry, které lze stanovit.

source: Figure: QElectroTech title block logo cell properties
cs: Obrázek: Vlastnosti buňky s logem v záhlaví výkresu v QElectroTechu

source: Name of the Scalable Vector Graphic (SVG) file with the logo image.
cs: Název souboru škálovatelné vektorové grafiky (SVG) s obrázkem loga.

source: Many different tools allows you to create Scalable Vector Graphics, SVG files. Inside the Open Source world, `Inkscape`_ is on of the recomended tools.
cs: Mnoho různých nástrojů vám umožňuje vytvářet soubory škálovatelné vektorové grafiky (Scalable Vector Graphics, SVG). Ve světě otevřeného zdrojového kódu je jedním z doporučených nástrojů `Inkscape`_.
