Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/elements/column.po
Languages: cs

source: Column
cs: Sloupec

source: Definition
cs: Popis

source: A column of `cells`_ from the `title block`_ is a group of `cells`_ that are placed one over the other.
cs: Sloupec `buněk`_ v `záhlaví výkresu`_ je skupina ` buněk`_, které jsou umístěny jedna nad druhou.

source: Properties
cs: Vlastnosti

source: At QElectroTech, a column from the `title block`_ has only one property, the width of the `cells`_ that are part of the columns.
cs: V QElectroTechu má sloupec v `záhlaví výkresu`_ pouze jednu vlastnost, šířku `buněk`_, které jsou součástí sloupců.

source: To display the column width:
cs: Pro zobrazení šířky sloupce:

source: Double click on the column head.
cs: Dvakrát klepněte na záhlaví sloupce.

source: Figure: QElectroTech title block column width property
cs: Obrázek: Vlastnost šířky sloupce v záhlaví výkresu v QElectroTechu

source: QElectroTech works with pixels, the width is defined according pixel unit.
cs: QElectroTech pracuje s obrazovými body (pixely), šířka je stanovena podle pixelové jednotky.

source: Unlike rows, the width of a column can be defined as:
cs: Na rozdíl od řádků lze šířku sloupce stanovit jako:

source: Absolut value, pixel units.
cs: Absolutní hodnota, pixelové jednotky.

source: Relative value to total, percent of the total width of the `title block`_.
cs: Relativní hodnota k celku, procento z celkové šířky `záhlaví výkresu`_.

source: Relative value to remaining, percent of the remaining width of the `title block`_.
cs: Relativní hodnota ke zbytku, procento ze zbývající šířky `záhlaví výkresu`_.
