Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/conductor/conductor_text.po
Languages: cs

source: Define text at conductor
cs: Stanovení textu u vodiče

source: QElectroTech allows defining and displaying information text at each `conductor`_.
cs: QElectroTech umožňuje stanovit a zobrazit text s informacíu každého `vodiče`_.

source: Only `multiline conductors`_ allow text definition.
cs: Stanovení textu umožňují pouze `vícežilové vodiče`_.

source: To define the conductor text:
cs: Pro stanovení textu vodiče:

source: `Select the conductor`_ which should be edited.
cs: `Vyberte vodič`_, který se má upravit.

source: `Display conductor properties`_ PopUp window.
cs: Vyskakovací okno pro `zobrazení vlastností vodiče`_.

source: Go to multiline section from **Type** tab.
cs: Na kartě **Typ** přejděte do části s vícežilovými vodiči.

source: Figure: QElectroTech multiline conductor text section
cs: Obrázek: Část s textem pro vícežilové vodiče v QElectroTechu

source: Choose the desired parametes for text positioning, text content or formula, text size, etc.
cs: Vyberte požadované parametry pro umístění textu, textový obsah nebovzorec, velikost textu atd.

source: Click the check buttom **Apply properties to all conductor of this potential** if the changes should be applied for all `conductor`_ with common initial or end `terminal`_.
cs: Klepněte na zaškrtávací tlačítko **Použít vlastnosti na všechny vodiče o tomto potenciálu**, pokud se změny mají použít pro všechny `vodiče`_ sespolečnou počáteční nebo koncovou `svorkou`_ .

source: Press **OK** button to save and apply the property changes.
cs: Stiskněte tlačítko **OK** pro uložení a použití změn vlastností.

source: For more information about multiline properties, refer to `conductor type properties`_ section.
cs: Další informace o vlastnostech vícežilových vodičů naleznete v části s `vlastnostmi typu vodiče`_.

source: For more information about automatic text definition during conductor creation, refer to `project folio properties`_ section.
cs: Další informace o automatickém stanovení textu běhemvytvoření vodiče naleznete v části s `vlastnostmi listu projektu`_.
