Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/customize/full_screen.po
Languages: cs

source: Full screen mode
cs: Režim na celou obrazovku

source: QElectroTech provides the option of displaying full screen. The full screen mode can be selected from `menu bar`_ and using keyboard shortcut.
cs: QElectroTech poskytuje možnost zobrazení na celou obrazovku. Režim celé obrazovky lze vybrat přes `hlavní nabídku`_ a pomocí klávesové zkratky.

source: Full screen mode from menu bar
cs: Režim na celou obrazovku přes hlavní nabídku

source: Select **Settings > FullScreen Mode** menu item to display QElectroTech in full screen mode.
cs: Vyberte položku **Nastavení > Režim na celou obrazovku** pro zobrazení QElectroTechu v režimu celé obrazovky.

source: Figure: QElectroTech settings menu
cs: Obrázek: Nabídka pro nastavení v QElectroTechu

source: Full screen mode using keyboard shortcut
cs: Režim na celou obrazovku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + Shift + f`` to display QElectroTech in full screen mode.
cs: Stiskněte klávesy ``Ctrl + Shift + F`` pro zobrazení QElectroTechu v režimu celé obrazovky.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.

source: To leave full screen mode, select **Settings > Leave FullScreen Mode** menu item or use again ``Ctrl + Shift + f`` keyboard shortcut.
cs: Pro opuštění režimu celé obrazovky vyberte položku nabídky **Nastavení > Ukončit režim na celou obrazovku** nebo znovu použijte klávesovou zkratku ``Ctrl + Shift + F``.
