Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/basics/ellipse.po
Languages: cs

source: Ellipse
cs: Elipsa

source: Create ellipse
cs: Vytvoření elipsy

source: To draw more easily, the folio grid can be displayed from **Display > Display the grid** or from `toolbar`_ icon |grid|.
cs: Pro snazší kreslení lze mřížku listu zobrazit přes **Zobrazení > Zobrazit mřížku** nebo v `panelu nástrojů`_ ikona |grid|.

source: The ellipse can only be added to the `workspace`_ by `toolbar`_.
cs: Elipsu lze do `pracovní plochy`_ přidat pouze z `panelu nástrojů`_.

source: Select the icon |ellipse| from the `toolbar`_ to add an ellipse.
cs: Pro přidání elipsy vyberte v `panelu nástrojů`_ ikonu |ellipse|.

source: Click on the initial controlling point from the ellipse.
cs: Klepněte na počáteční ovládací bod elipsy.

source: Click on the end controlling point from the ellipse.
cs: Klepněte na koncový ovládací bod elipsy.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Add**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Přidání**.

source: Ellipse properties
cs: Vlastnosti elipsy

source: The border line and the internal area from the ellipse can be costumized at QElectroTech.
cs: Hraniční čáru a vnitřní oblast elipsy lze přizpůsobit v QElectroTechu.

source: The border line from a ellipse has the same properties as a `line`_.
cs: Hraniční čára elipsy má stejné vlastnosti jako `čára`_.

source: The type of filling for closed primitive objects (rectangle, ellipse and closed polygon) are: **None**, **Solid line** and some types of grids.
cs: Typ výplně pro uzavřené jednoduché předměty (obdélník, elipsa a uzavřený mnohoúhelník) jsou: **Žádná**, **Plná čára** a některé typy mřížek.

source: Figure: QElectroTech Color selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr barvy v QElectroTechu

source: The possible filling colors are defined by the `RGB scale range`_.
cs: Možné barvy výplně jsou stanoveny `rozsahem stupnice RGB`_.

source: The position from the ellipse can be locked to prevent involuntary movement.
cs: Polohu elipsy lze uzamknout, aby se zabránilo nechtěným pohybům.

source: Go to ellipse properties and check the **Lock position** button.
cs: Přejděte na vlastnosti elipsy a zaškrtněte tlačítko **Zamknout polohu**.

source: The ellipse properties can be displayed from `menu bar`_, by right click on border from the ellipse, from selection properties panel and using keyboard shortcut.
cs: Vlastnosti elipsy lze zobrazit přes `hlavní nabídku`_, klepnutím pravým tlačítkem na hraniční čáru elipsy, z panelu vlastností výběru a pomocí klávesové zkratky.

source: Ellipse properties from menu bar
cs: Vlastností elipsy přes hlavní nabídku

source: Select the border from the ellipse which should be edited.
cs: Vyberte okraj elipsy, která se má upravit.

source: Select **Edit > Edit the selected object** menu item to display the ellipse properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi elipsy vyberte položku nabídky **Úpravy > Upravit vybraný předmět**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Ellipse properties by right click
cs: Vlastnosti elipsy pomocí klepnutí pravým tlačítkem myši

source: Right click on the border from the ellipse which should be edited.
cs: Klepněte pravým tlačítkem myši na okraj elipsy, která se má upravit.

source: Select the option **Edit the selected object** to display the ellipse properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi elipsy vyberte **Upravit vybraný předmět**.

source: Figure: QElectroTech ellipse selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr elipsy v QElectroTechu

source: Ellipse properties from selection properties panel
cs: Vlastnosti elipsy v panelu s vlastnostmi výběru

source: Select one the border from the ellipse which should be edited and the properties from the ellipse will appear at `selection properties panel`_.
cs: Vyberte okraj elipsy, která se má upravit a v `panelu vlastností výběru`_ se objeví vlastnosti elipsy.

source: Figure: QElectroTech ellipse properties panel
cs: Obrázek: Panel s vlastnostmi elipsy v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**

source: Ellipse properties using keyboard shortcut
cs: Vlastnosti elipsy pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the ellipse properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi elipsy stiskněte ``Ctrl + e``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
