Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/basics/polygon.po
Languages: cs

source: Polygon
cs: Mnohoúhelník

source: Create polygon
cs: Vytvoření mnohoúhelníku

source: To draw more easily, the folio grid can be displayed from **Display > Display the grid** or from `toolbar`_ icon |grid|.
cs: Pro snazší kreslení lze mřížku listu zobrazit přes **Zobrazení > Zobrazit mřížku** nebo v `panelu nástrojů`_ ikona |grid|.

source: The polygon can only be added to the `workspace`_ by `toolbar`_.
cs: Mnohoúhelník lze do `pracovní plochy`_ přidat pouze z `panelu nástrojů`_.

source: Select the icon |polygon| from the `toolbar`_ to add a polygon.
cs: Pro přidání mnohoúhelníku vyberte v `panelu nástrojů`_ ikonu |polygon|.

source: Draw connected lines by simple click on the beginning and end point from each line.
cs: Nakreslete spojené čáry jednoduchým klepnutím na počáteční a koncový bod každé čáry.

source: Doble Click on the end vertex/point from the polygon.
cs: Dvakrát klepněte na koncový vrchol/bod mnohoúhelníku.

source: At everytime from the polygon creation, the previous line can be deleted without stopping the creation process.
cs: Kdykoli během vytváření mnohoúhelníku lze předchozí čáru odstranit bez zastavení procesu vytváření.

source: Right click will delete the previous line without losing all previous work.
cs: Klepnutí pravým tlačítkem myši smaže předchozí čáru bez ztráty vší předchozí práce.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Add**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Přidání**.

source: Polygon properties
cs: Vlastnosti mnohoúhelníku

source: A polygon is a plane figure generated by a finite number of line segments connected. When the initial and end line segments from the polygon are connected, the polygon defines a closed area.
cs: Mnohoúhelník je rovinný obrazec tvořený konečným počtem spojených úseček. Když jsou počáteční a koncové úsečky mnohoúhelníku spojeny, mnohoúhelník určuje uzavřenou oblast.

source: When the polygon do not define a closed area, the properties from the polygon object are the same as a `line object`_.
cs: Když mnohoúhelník neurčuje uzavřenou oblast, vlastnosti předmětu mnohoúhelníku jsou stejné jako `předmětu čáry`_.

source: When the poligon defines a closed area, the **Closed polygon** check button from the polygon properties panel is selected, the polygon object has the same propertias as a `rectangle object`_.
cs: Když mnohoúhelník určuje uzavřenou oblast, je v panelu vlastností mnohoúhelníku vybráno zaškrtávací tlačítko **Uzavřený mnohoúhelník**, předmět mnohoúhelníku má stejné vlastnosti jako `předmět obdélníku`_.

source: If the initial and the end line segments from the polygon are not connected when the **Closed polygon** check button is selected, a new line segment which connects both segments will be automatically generated.
cs: Pokud nejsou počáteční a koncová úsečka mnohoúhelníku spojeny, když je vybráno zaškrtávací tlačítko **Uzavřený mnohoúhelník**, bude automaticky vytvořena nová úsečka, která spojí obě části.

source: The polygon properties can be displayed from `menu bar`_, by right click on one polygon edge/line, from selection properties panel and using keyboard shortcut.
cs: Vlastnosti mnohoúhelníku lze zobrazit přes `hlavní nabídku`_, klepnutím pravým tlačítkem na okraj/čáru mnohoúhelníku, z panelu vlastností výběru a pomocí klávesové zkratky.

source: Polygon properties from menu bar
cs: Vlastností mnohoúhelníku přes hlavní nabídku

source: Select one of the edges/lines from the polygon which should be edited.
cs: Vyberte jeden z okrajů/čar mnohoúhelníku, který se má upravit.

source: Select **Edit > Edit the selected object** menu item to display the polygon properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi mnohoúhelníku vyberte položku nabídky **Úpravy > Upravit vybraný předmět**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Polygon properties by right click
cs: Vlastnosti mnohoúhelníku pomocí klepnutí pravým tlačítkem myši

source: Right click on one of the edges/lines from the polygon which should be edited.
cs: Klepněte pravým tlačítkem myši na jeden z okrajů/jednu z čar mnohoúhelníku, který se má upravit.

source: Select the option **Edit the selected object** to display the polygon properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi mnohoúhelníku vyberte **Upravit vybraný předmět**.

source: Figure: QElectroTech polygon selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr mnohoúhelníku v QElectroTechu

source: Polygon properties from selection properties panel
cs: Vlastnosti mnohoúhelníku v panelu s vlastnostmi výběru

source: Select one of the edges/lines from the polygon which should be edited and the properties from the polygon will appear at `selection properties panel`_.
cs: Vyberte jeden z okrajů/čar mnohoúhelníku, který se má upravit, a v `panelu vlastností výběru`_ se objeví vlastnosti mnohoúhelníku.

source: Figure: QElectroTech Polygon properties panel
cs: Obrázek: Panel s vlastnostmi mnohoúhelníku v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**

source: Polygon properties using keyboard shortcut
cs: Vlastnosti mnohoúhelníku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the polygon properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi mnohoúhelníku stiskněte ``Ctrl + e``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.

source: Add new point to polygon
cs: Přidání nového bodu do mnohoúhelníku

source: Right click on the place from the edges/lines of the polygon where the new porint should be created.
cs: Klepněte pravým tlačítkem myši na místo na okrajích/čárách mnohoúhelníku, kde se má vytvořit nový bod.

source: Select the option **Add a point** to create the new point at the polygon.
cs: Pro vytvoření nového bodu mnohoúhelníku vyberte volbu **Přidat bod**.

source: Delete point to polygon
cs: Smazání bodu mnohoúhelníku

source: Right click on the point from the polygon which should be deleted.
cs: Klepněte pravým tlačítkem myši na bod mnohoúhelníku, který se má smazat.

source: Select the option **Delete this point** to delete the point from the polygon.
cs: Pro smazání bodu mnohoúhelníku vyberte volbu **Smazat tento bod**.
