Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/basics/rectangle.po
Languages: cs

source: Rectangle
cs: Obdélník

source: Create rectangle
cs: Vytvoření obdélníku

source: To draw more easily, the folio grid can be displayed from **Display > Display the grid** or from `toolbar`_ icon |grid|.
cs: Pro snazší kreslení lze mřížku listu zobrazit přes **Zobrazení > Zobrazit mřížku** nebo v `panelu nástrojů`_ ikona |grid|.

source: The rectangle can only be added to the `workspace`_ by `toolbar`_.
cs: Obdélník lze do `pracovní plochy`_ přidat pouze z `panelu nástrojů`_.

source: Select the icon |rectangle| from `toolbar`_ to add a rectangle.
cs: Pro přidání obdélníku vyberte v `panelu nástrojů`_ ikonu |rectangle|.

source: Click on the initial vertix from the rectangle.
cs: Klepněte na počáteční vrchol obdélníku.

source: Click on the end vertex from the rectangle.
cs: Klepněte na koncový vrchol obdélníku.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Add**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Přidání**.

source: Rectangle properties
cs: Vlastnosti obdélníku

source: The edges and the internal area from the triangle can be costumized at QElectroTech.
cs: Okraje a vnitřní oblast trojúhelníku lze přizpůsobit v QElectroTechu.

source: The edges from a rectangle have the same properties as a `line`_.
cs: Okraje obdélníku mají stejné vlastnosti jako `čára`_.

source: The type of filling for closed primitive objects (rectangle, ellipse and closed polygon) are: **None**, **Solid line** and some types of grids.
cs: Typ výplně pro uzavřené jednoduché předměty (obdélník, elipsa a uzavřený mnohoúhelník) jsou: **Žádná**, **Plná čára** a některé typy mřížek.

source: Figure: QElectroTech Color selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr barvy v QElectroTechu

source: The possible filling colors are defined by the `RGB scale range`_.
cs: Možné barvy výplně jsou stanoveny `rozsahem stupnice RGB`_.

source: The position from the rectangle can be locked to prevent involuntary movement.
cs: Polohu obdélníku lze uzamknout, aby se zabránilo nechtěným pohybům.

source: Go to rectangle properties and check the **Lock position** button.
cs: Přejděte na vlastnosti obdélníku a zaškrtněte tlačítko **Zamknout polohu**.

source: The rectangle properties can be displayed from `menu bar`_, by right click on one rectangle edge, from selection properties panel and using keyboard shortcut.
cs: Vlastnosti obdélníku lze zobrazit přes `hlavní nabídku`_, klepnutím pravým tlačítkem na okraj obdélníku, z panelu vlastností výběru a pomocí klávesové zkratky.

source: Rectangle properties from menu bar
cs: Vlastností obdélníku přes hlavní nabídku

source: Select one of the edges from the rectangle which should be edited.
cs: Vyberte jeden z okrajů obdélníku, který se má upravit.

source: Select **Edit > Edit the selected object** menu item to display the rectangle properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi obdélníku vyberte položku nabídky **Úpravy > Upravit vybraný předmět**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy v QElectroTechu

source: Rectangle properties by right click
cs: Vlastnosti obdélníku pomocí klepnutí pravým tlačítkem myši

source: Right click on one of the edges from the rectangle which should be edited.
cs: Klepněte pravým tlačítkem myši na jeden z okrajů obdélníku, který se má upravit.

source: Select the option **Edit the selected object** to display the rectangle properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi obdélníku vyberte **Upravit vybraný předmět**.

source: Figure: QElectroTech rectangle selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr obdélníku v QElectroTechu

source: Rectangle properties from selection properties panel
cs: Vlastnosti obdélníku v panelu s vlastnostmi výběru

source: Select one of the edges from the rectangle which should be edited and the properties from the rectangle will appear at `selection properties panel`_.
cs: Vyberte jeden z okrajů obdélníku, který se má upravit a v `panelu vlastností výběru`_ se objeví vlastnosti obdélníku.

source: Figure: QElectroTech Rectangle properties panel
cs: Obrázek: Panel s vlastnostmi obdélníku v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**

source: Rectangle properties using keyboard shortcut
cs: Vlastnosti obdélníku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the rectangle properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi obdélníku stiskněte ``Ctrl + e``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
