Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/editor_quit.po
Languages: cs

source: Quit element editor
cs: Ukončení editoru prvku

source: The user can close `QElectroTech element editor`_ at any time. The user does not need to `save`_ the changes on the `element`_ before closing it.
cs: Uživatel může kdykoli zavřít `editor prvku v QElectroTechu`_. Uživatelnemusí před zavřením `uložit`_ změny `prvku`_.

source: If the current work wants to be saved before closing the `element editor`_, refer to `save`_ section. Even so, QElectroTech display an automatic message to `save`_ the current job if any modification has been created.
cs: Pokud má být nynější dílo uloženo před zavřením `editoru prvku`_, viz část `uložit`_. I přesto QElectroTech, pokud došlo ke změně, zobrazuje automatickou zprávu o `uložení` nynější úlohy.

source: Figure: QElectroTech element editor save message
cs: Obrázek: Zpráva o uložení v editoru prvku v QElectroTechu

source: Exit QElectroTech element editor from menu bar
cs: Opuštění editoru prvku v QElectroTechu přes hlavní nabídku

source: Select **File > Quit** menu item to quit QElectroTech element editor.
cs: Pro opuštění editoru prvku v QElectroTechu vyberte položku nabídky **Soubor > Ukončit**.

source: Figure: QElectroTech element editor file menu
cs: Obrázek: Nabídka Soubor editoru prvku v QElectroTechu

source: Exit QElectroTech element editor using keyboard shortcut
cs: Opuštění editoru prvku v QElectroTechu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + q`` to quit QElectroTech element editor.
cs: Pro opuštění editoru prvku v QElectroTechu stiskněte ``Ctrl + Q``

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
