Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/select/select_multiple_objects.po
Languages: cs

source: Select multiple objects
cs: Vybrání více předmětů

source: As many CAD tools, many objects (`elements`_, `conductors`_, `text fields`_, `basic objects`_ and `pictures`_) from `workspace`_ can be selected in QElectroTech at the same time.
cs: Stejně jako mnoho nástrojů CAD, mnoho předmětů (`prvky`_, `vodiče`_, `textovápole`_, `základní předměty`_ a `obrázky`_) v `pracovní ploše`_ může býtv QElectroTechu vybráno současně.

source: Select multiple objects using keyboard and mouse
cs: Vybrání více předmětů pomocí klávesové zkratky a myši

source: QElectroTech allows selecting multiple objects from the `workspace`_, combining the use of keyboard and mouse.
cs: QElectroTech umožňuje výběr více předmětů v `pracovní ploše`_kombinující použití klávesnice a myši.

source: `Select`_ the first object.
cs: `Vyberte`_ první předmět.

source: Press ``Ctrl``.
cs: Stiskněte ``Ctrl``.

source: `Select`_ the rest of objects without releasing ``Ctrl``.
cs: `Vyberte`_ zbytek předmětů bez uvolnění klávesy `` Ctrl``.

source: Figure: QElectroTech schema
cs: Obrázek: Výkres v QElectroTechu

source: Select multiple objects by selecting area
cs: Vybrání více předmětů pomocí výběru oblasti

source: QElectroTech allows selecting all objects from an area using the mouse to select the desired area.
cs: QElectroTech umožňuje vybrat všechny předměty v oblasti pomocímyši pro vybrání požadované oblasti.

source: Left click on the initial point from the rectangular area to be selected and displace the mouse without releasing up to the end point.
cs: Klepněte levým tlačítkem na počáteční bod obdélníkové oblasti, kterou chcete vybrat,a přesuňte myš bez uvolnění tlačítka nahoru na koncový bod.

source: Figure: QElectroTech selecting on workspace
cs: Obrázek: Výběr v pracovní ploše v QElectroTechu
