Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/copy.po
Languages: cs

source: Copy part
cs: Kopírování části

source: QElectroTech element editor allows copying the different possible type of `parts`_ to paste them later on at different place from the element editor workspace.
cs: Editor prvku v QElectroTechu umožňuje kopírování různých možných typů `částí`_ a jejich pozdější vložení na jiné místo z pracovní plochy editoru prvku.

source: Multiples `parts`_ can be copied at the same time, pressing ``Ctrl`` is necessary to select more than one `part`_.
cs: Více `částí`_ lze kopírovat současně. Pro vybrání více než jedné `části` je nutné stisknout klávesu ``Ctrl``.

source: Copying parts can be done from `menu bar`_, by right click on the `part`_ and using the corresponding keyboard shortcut.
cs: Kopírování částí lze provádět přes `hlavní nabídku`_, klepnutím pravým tlačítkem na `část`_ a pomocí odpovídající klávesové zkratky.

source: Copy part from menu bar
cs: Kopírování části přes hlavní nabídku

source: Select the `part`_ which should be copied.
cs: Vyberte `část`_, která se má zkopírovat.

source: Select **Edit > Copy** menu item to copy the `part`_.
cs: Pro kopírování `části`_ vyberte položku nabídky **Úpravy > Kopírovat**.

source: Figure: QElectroTech element editor Edit menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Copy part by right click
cs: Kopírování části klepnutím pravým tlačítkem myši

source: Right click on the `part`_ which should be copied.
cs: Klepněte pravým tlačítkem myši na `část`_, která se má zkopírovat.

source: Select the option **Copy** to copy the `part`_.
cs: Pro kopírování `části`_ vyberte volbu **Kopírovat**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Copy part using keyboard shortcut
cs: Kopírování části pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + c`` to copy the `part`_.
cs: Pro kopírování `části`_ stiskněte ``Ctrl + c``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
