Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/cut.po
Languages: cs

source: Cut part
cs: Vyjmutí části

source: QElectroTech element editor allows cutting the different possible type of `parts`_ to paste them later on at different place from the element editor workspace.
cs: Editor prvku v QElectroTechu umožňuje vyjmutí různých možných typů `částí`_ a jejich pozdější vložení na jiné místo z pracovní plochy editoru prvku.

source: Multiples `parts`_ can be cut at the same time, pressing ``Ctrl`` is necessary to select more than one `part`_.
cs: Více `částí`_ lze vyjmout současně. Pro vybrání více než jedné `části` je nutné stisknout klávesu ``Ctrl``.

source: Cutting `parts`_ can be done from `menu bar`_, by right click on the `part`_ and from the corresponding keyboard shortcut.
cs: Vyjmutí `částí` lze provádět přes `hlavní nabídku`_, klepnutím pravým tlačítkem na `část`_ a pomocí odpovídající klávesové zkratky.

source: Cut part from menu bar
cs: Vyjmutí části přes hlavní nabídku

source: Select the `part`_ which should be cut.
cs: Vyberte `část`_, která se má vyjmout.

source: Select **Edit > Cut** menu item to cut the `part`_.
cs: Pro vyjmutí `části`_ vyberte položku nabídky **Úpravy > Vyjmout**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Cut part by right click
cs: Vyjmutí části klepnutím pravým tlačítkem myši

source: Right click on the `part`_ which should be cut.
cs: Klepněte pravým tlačítkem myši na `část`_, která se má vyjmout.

source: Select the option **Cut** to cut the `part`_.
cs: Pro vyjmutí `části`_ vyberte volbu **Vyjmout**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Cut part using keyboard shortcut
cs: Vyjmutí části pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + x`` to cut the `part`_.
cs: Pro vyjmutí `části`_ stiskněte ``Ctrl + x``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
