Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/delete.po
Languages: cs

source: Delete part
cs: Smazání části

source: QElectroTech element editor allows deleting `parts`_ which has been `added`_ or `pasted`_ at the `element editor workspace`_ previously.
cs: Editor prvku v QElectroTechu umožňuje mazání `částí`_, které byly již dříve `přidány`_ nebo `vloženy`_ do `pracovní plochy editoru prvku`.

source: Deleting parts can be done from `menu bar`_, `toolbar`_, by right click on the `part`_ and using the corresponding keyboard shortcut.
cs: Smazání částí lze provádět přes `hlavní nabídku`_, `pruh s nástroji`_, klepnutím pravým tlačítkem na `část`_ a pomocí odpovídající klávesové zkratky.

source: Delete part from menu bar
cs: Smazání části přes hlavní nabídku

source: `Select`_ the `part`_ which should be deleted.
cs: `Vyberte`_ `část`_, která se má smazat.

source: Select **Edit > Delete** menu item to delete the `part`_ from `workspace`_.
cs: Pro smazání `části`_ v `pracovní ploše`_ vyberte položku nabídky **Úpravy > Vyjmout**.

source: Figure: QElectroTech element editor Edit menu
cs: Obrázek: Nabídka pro úpravy v editoru prvku v QElectroTechu

source: Delete part from toolbar
cs: Smazání části přes pruh s nástroji

source: Select the icon |edit-delete| from the `toolbar`_ to delete the `part`_ from `workspace`_.
cs: Pro smazání `části`_ v `pracovní ploše`_ v `panelu nástrojů`_ vyberte ikonu |edit-delete|.

source: If the `toolbar`_ is not displayed, it can be displaed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**

source: Delete part by right click
cs: Smazání části klepnutím pravým tlačítkem myši

source: Right click on the `part`_ which should be deleted.
cs: Klepněte pravým tlačítkem myši na `část`_, která se má smazat.

source: Select the option **Delete** to delete the `part`_ from `workspace`_.
cs: Pro smazání `části`_ v `pracovní ploše`_ vyberte volbu **Smazat**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Delete part using keyboard shortcut
cs: Smazání části pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Del`` to delete the `part`_ from `workspace`_.
cs: Pro smazání `části`_ v `pracovní ploše`_ stiskněte ``Del``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
