Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/text/link_url.po
Languages: cs

source: Insert URL link
cs: Vložení odkazu (adresy) URL

source: QElectroTech works with text as html code. This property allows the user introducing at the `workspace`_ anything that is possible with HTM code. This section explains how the user can create an URL link for a text.
cs: QElectroTech pracuje s textem jako kódem HTML. Tato vlastnost uživatelido `pracovní plochy`_ umožňuje zavést vše, co je možné pomocí kódu HTM.Tato část vysvětluje, jak může uživatel vytvořit odkaz (adresu URL) na text.

source: The URL link is only actived at the PDF version of the document. The link is not actived at the native QElectroTech format.
cs: Odkaz (URL) je v činnosti pouze u verze dokumentu ve formátu PDF. Odkaznení zprovozněn v původním formátu QElectroTechu.

source: At the current released version, version 0.7, QElectroTech allows creating an URL link internally or using external html code generators.
cs: V nyní vydané verzi (verze 0.7) QElectroTech umožňujevnitřní vytvoření odkazu URL nebo použití vnějších tvůrců kódu HTML.

source: Insert URL link from QElectroTech text editor
cs: Vložení odkazu (adresy) URL v editoru textu v QElectroTechu

source: Display the `text editor`_ by editing the desired `text field`_.
cs: Zobrazte `textový editor`_ úpravou požadovaného `textového pole`_.

source: Figure: QElectroTech Text editor rich text tab
cs: Obrázek: Karta pro formátovaný text v editoru textu v QElectroTechu

source: Press the icon **Insert link** from the Menu bar for displaying the Insert link PopUP window.
cs: Pro zobrazení vyskakovacího okna pro vložení odkazustiskněte ikonu **Vložit odkaz**.

source: Figure: QElectroTech insert link PopUP window
cs: Obrázek: Vyskakovací okno pro vložení odkazu v QElectroTechu

source: Define the text which should be displayed at the `workspace`_ and the desired URL where the link should redirect.
cs: Stanovte text, který se má zobrazit v `pracovní ploše`_, apožadovanou adresu URL, na kterou by měl odkaz přesměrovat.

source: Press the button **OK** to close the Insert link PopUP window and add the link to the text field content.
cs: Stiskněte tlačítko **OK** pro zavření vyskakovacího okna pro vložení odkazu a přidáníodkazu do obsahu textového pole.

source: Press the button **OK** to save the text field content and close the `text editor`_.
cs: Stiskněte tlačítko **OK** pro uložení obsahu textového pole a zavření`textového editoru`_.

source: Insert URL link using external html code generators
cs: Vložení odkazu (adresy) URL pomocí vnějších tvůrců kódu HTML

source: At the case that something special should be included or any propertie should be different, QElectroTech allows creating the html source code using an external code generator and later on introduce the code.
cs: V případě, že se má zahrnout něco zvláštního nebo má být jinánějaká vlastnost, QElectroTech umožňuje vytvářet zdrojový kód HTMLpomocí vnějšího tvůrce kódu a později kód zavést.

source: Select the source Tab.
cs: Vyberte kartu se zdrojem.

source: Figure: QElectroTech Text editor source tab
cs: Obrázek: Karta se zdrojem v editoru textu v QElectroTechu

source: Copy the html code from the html code generator.
cs: Zkopírujte kód HTML z tvůrce kódu HTML.

source: Many different HTML Table Generator can be found on interned or can be installed at the computer. One internet example is the following:
cs: Na internetu lze nalézt mnoho různých tvůrců tabulek HTML. Nebo mohou býtnainstalováni v počítači. Jedním z příkladů takového programu z internetu je:
