Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/text/text_rotate.po
Languages: cs

source: Rotate text
cs: Otočení textu

source: The content from a `text field`_ can be rotated in two different ways:
cs: Obsah `textového pole`_ lze otočit dvěma různými způsoby:

source: Rotating the `text field`_ as an object.
cs: Otočení `textového pole`_ jako předmětu.

source: Defining the text orientation inside the `text field`_.
cs: Stanovení natočení textu uvnitř `textového pole`_.

source: Rotate text field
cs: Otočení textového pole

source: The text field is considered an object by QElectroTech, it can be selected, placed and rotated as `elements`_ and `pictures`_. It can be rorated *90*, *180* or *270* degrees.
cs: Textové pole je v QElectroTechu považováno za předmět. Může být vybráno, umístěno a otočeno tak jako `prvky`_ a `obrázky`_. Může být otočeno o *90*, *180* nebo *270* stupňů.

source: Right click on the `text field`_ which should be rotated.
cs: Klepněte pravým tlačítkem myši na `textové pole`_, které se má otočit.

source: Figure: QElectroTech text field options
cs: Obrázek: Volby pro textové pole v QElectroTechu

source: Select the option **Rotate** to rotate the `text field`_ *90* degrees on the clock direction.
cs: Pro otočení `textového pole`_ o *90* stupňů po směru hodinových ručiček vyberte volbu **Otočit**.

source: For more information about rotating objects at the `workspace`_, refer to `rotate object section`_.
cs: Další informace o otáčení předměty v `pracovní ploše`_ najdete v části k `točení předmětem`_.

source: Define text orientation
cs: Stanovení natočení textu

source: Defining the text orientation rotates only the content from the `text field`_. The advantage of choosing the text orientation is the possibility to choose any angle between *-360* and *360* degrees.
cs: Stanovení natočení textu otočí v `textovém poli`_ pouze obsahem. Výhodou volby pro natočení textu je možnost zvolit libovolný úhel mezi *-360* a *360* stupni.

source: Define text orientation from workspace
cs: Stanovení natočení textu v pracovní ploše

source: Right click on the `text field`_ which should be oriented.
cs: Klepněte pravým tlačítkem myši na `textové pole`_, které se má natočit.

source: Select the option **Choose text orientation** to display the text orientation PopUP window.
cs: Pro zobrazení vyskakovacího okna pro natočení textu vyberte volbu **Natočit texty**.

source: Figure: QElectroTech choose orientation PopUP window
cs: Obrázek: Vyskakovací okno pro natočení textu v QElectroTechu

source: Define the orientation angle of the text.
cs: Stanovte úhel natočení textu.

source: Press **OK** to save the changes.
cs: Stiskněte **OK** pro uložení změn.

source: Define text orientation from selection properties panel
cs: Stanovení natočení textu v panelu s vlastnostmi výběru

source: Select the `text field`_ which should be oriented.
cs: Vyberte `textové pole`_, které se má natočit.

source: Define the orientation angle of the text at **Angle** field from `selection properties panel`_.
cs: Stanovte úhel natočení textu v poli **Úhel** v `panelu s vlastnostmi výběru`_.

source: Figure: QElectroTech text field selection properties panel
cs: Obrázek: Panel s vlastnostmi výběru pro textové pole v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**.
