Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/text/text_editor.po
Languages: cs

source: Text editor
cs: Editor textu

source: The text editor from QElectroTech allows two different philosophy to introduce text in the `workspace`_:
cs: Textový editor v QElectroTechu umožňuje dva různé přístupyke vkládání textu do `pracovní plochy`_:

source: What You See Is What You Get (WYSIWYG)
cs: Co vidíte, to také dostanete (WYSIWYG)

source: HTML code to create content and define format.
cs: Kód v HTML pro vytvoření obsahu a stanovení formátu.

source: Rich text tab
cs: Karta pro formátovaný text

source: The Rich text tab is used when the WYSIWYG philosophy is applied. The different options from the rich text are:
cs: Karta pro formátovaný text se používá při použití pojetí WYSIWYG. Různými možnostmi formátovaného textu jsou:

source: Definition of content.
cs: Stanovení obsahu.

source: Definition of font color.
cs: Stanovení barvy písma.

source: Definition of font size.
cs: Stanovení velikosti písma.

source: Definition of aditional font options (underlinel, bold and italic style, superscript, subscript)
cs: Stanovení dalších voleb pro písmo (podtržení, tučné písmo a kurzíva,horní index, dolní index)

source: Figure: QElectroTech Text editor rich text tab
cs: Obrázek: Karta pro formátovaný text v editoru textu v QElectroTechu

source: Source tab
cs: Karta pro zdroj

source: The source tab is used when the text content and the format is defined using HTML code. QElectroTech processes internally the HTML code and compiles the result to be shown. The formatting limits are at HTML code.
cs: Karta pro zdroj se používá, když je stanoven textový obsah a formátpomocí kódu v HTML. QElectroTech vnitřně zpracovává HTML kód apřekládá výsledek, který se má zobrazit. Omezení formátování jsou v kódu HTML.

source: Figure: QElectroTech Text editor source tab
cs: Obrázek: Karta se zdrojem v editoru textu v QElectroTechu
