Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/editor_quit.po
Languages: cs_cz

source: Quit title block editor
cs_cz: Ukončení editoru záhlaví výkresu

source: The `title block editor`_ can be closed at any time, only the changes have to be `saved`_ before closing it. QElectroTech displays an automatic message to save the current job if any modification has been created.
cs_cz: `Editor záhlaví výkresu`_ lze kdykoli zavřít, pouze musí být změny `uloženy`_ před jeho zavřením. QElectroTech zobrazuje automatickou zprávu pro uložení aktuální úlohy, pokud byla vytvořena nějaká změna.

source: Figure: QElectroTech title block editor save message
cs_cz: Obrázek: Zpráva o uložení editoru záhlaví výkresu v QElectroTechu

source: Exit QElectroTech title block editor from menu bar
cs_cz: Opustit editor záhlaví výkresu v QElectroTechu přes hlavní nabídku

source: Select **File > Quit** menu item to quit QElectroTech `title block editor`_.
cs_cz: Vyberte položku nabídky **Soubor > Ukončit** pro ukončení `editoru záhlaví výkresu`_.

source: Figure: QElectroTech title block editor File menu
cs_cz: Obrázek: Nabídka pro soubor editoru záhlaví výkresu v QElectroTechu

source: Exit QElectroTech title block editor using keyboard shortcut
cs_cz: Opuštění editoru záhlaví výkresu v QElectroTechu pomocí klávesové zkratky.

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs_cz: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + q`` to quit QElectroTech `title block editor`_.
cs_cz: Stiskněte ``Ctrl + q`` pro ukončení `editoru záhlaví výkresu`_ QElectroTechu.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs_cz: Další informace o klávesových zkratkách QElectroTechu najdete v části `hlavní nabídka`_.
