Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/element/references/related_items.po
Languages: cs

source: Show linked item
cs: Ukázání propojeného prvku

source: On of the advantages of working with `cross references`_ on E-CAE tools like QElectroTech is the posibility to find the linked `elements`_ automatically. QElectroTech allows finding a linked `element`_ easily.
cs: Jednou z výhod práce s `křížovými odkazy`_ v nástrojích E-CAEjako QElectroTech je možnost najít propojené `prvky`_automaticky. QElectroTech umožňuje snadné vyhledání propojeného `prvku`_.

source: If the `master`_ and `slave/s`_ element/s are at the same `folio`_, only by placing the mouse at one `element`_, the other/s will be remarked in blue. The linked `element/s`_ can also be found from the `element properties`_.
cs: Pokud jsou `nadřízený`_ a `podřízený(é)`_ ve stejném `listu`_, pouzeumístěním myši na jeden `prvek`_ budou ostatní modře označeni.Propojený `prvek(y)`_ lze najít také ve `vlastnostech prvku`_.

source: Figure: QElectroTech elements cross reference
cs: Obrázek: Křížový odkaz prvku v QElectroTechu

source: At the case that the `elements`_ are at different `folios`_, the linked `element/s`_ can only be found from the `element properties`_.
cs: V případě, že `prvky`_ jsou na různých `fo_, propojený(é)`prvek(y)`_ lze najít pouze ve `vlastnostech prvku`_.

source: Show slave linked item
cs: Ukázání propojeného podřízeného prvku

source: Select the `slave element`_ which should be linked from the `project collection`_ or from the `workspace`_.
cs: Vyberte `podřízený prvek`_, který se má propojit ve `sbírce projektu`_ nebo v `pracovní ploše`_.

source: Right click on the `element`_ selected and choose the option **Edit the element**.
cs: Klepněte pravým tlačítkem myši na vybraný `prvek`_ a vyberte volbu **Upravit prvek**.

source: Figure: QElectroTech element options
cs: Obrázek: Volby pro prvek v QElectroTechu

source: `Display`_ the **Cross-reference (Slave)** tab from the element editor PopUP window
cs: Ve vyskakovacím okně editoru prvku `zobrazte`_ kartu **Křížový odkaz (podřízený)**

source: Figure: QElectroTech cross reference tab element properties
cs: Obrázek: Vlastnosti prvku v kartě pro křížový odkaz v QElectroTechu

source: Search and select the desired `slave element`_ from the **Element related** table.
cs: Vyhledejte a vyberte požadovaný `podřízený prvek`_ v tabulce **Spojené prvky**.

source: Right clik on the `slave element`_ and select the option **Show item** to find and display the `master element`_.
cs: Klepněte pravým tlačítkem myši na `podřízený prvek`_ a vyberte volbu **Ukázat prvek** pro nalezení a zobrazení `nadřízeného prvku`_.

source: Show Master linked item
cs: Ukázání propojeného nadřízeného prvku

source: Select the `slave element`_ from the `project collection`_ or from the `workspace`_.
cs: Vyberte `podřízený prvek`_, ve `sbírce projektu`_ nebo v `pracovní ploše`_.

source: Right click on the selected element and choose the option **Edit the element**.
cs: Klepněte pravým tlačítkem myši na vybraný prvek a vyberte volbu **Upravit prvek**.

source: Press **See the linked item** to find and display the `master element`_.
cs: Stiskněte **Vidět spojený prvek**pro nalezení a zobrazení `nadřízeného prvku`_.
