Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/properties/element_numbering.po
Languages: cs

source: Element numbering
cs: Číslování prvků

source: QElectroTech allows an automatic codification of `elements`_. This feature is useful for the creation of reports, `Bill of Materials (BOM)`_, and for the identification of devices at the physical installation and schemas.
cs: QElectroTech umožňuje automatické utřídění `prvků`_.Tato funkce je užitečná pro vytváření odkazů, `kusovník(BOM)`_ a pro rozpoznání zařízení ve fyzickéinstalaci a výkresy.

source: QElectroTech allows defining multiples auto numbering patterns. It also provides many flexibility on the creation of auto numbering pattern using text, variables and sequential numbers.
cs: QElectroTech umožňuje stanovit více vzorů automatického číslování. To taképoskytuje mnoho pružnosti při vytváření vzoru automatického číslování pomocítextu, proměnné a pořadových čísel.

source: Figure: QElectroTech element auto numbering
cs: Obrázek: Automatické očíslování prvku v QElectroTechu

source: Example
cs: Příklad

source: Code defined by `IEC 81346`_ norm.
cs: Kód stanovený normou ʻIEC 81346`_.

source: **A**: Two or more purposes or tasks.
cs: **A**: Dva nebo více účelů nebo úkolů.

source: **B**: Converting an input variable into a signal for further processing.
cs: **B**: Převod vstupní proměnné na signál pro další zpracování.

source: **C**: Storing of energy, information or material.
cs: **C**: Skladování energie, informací nebo materiálu.

source: **E**: Providing radiant or thermal energy.
cs: **E**: Poskytování sálavé nebo tepelné energie.

source: **F**: Direct protection from dangerous or unwanted conditions.
cs: **F**: Přímá ochrana před nebezpečnými nebo nežádoucími podmínkami.

source: **G**: Initiating a flow of energy or material.
cs: **G**: Zahájení toku energie nebo materiálu.

source: **H**: Producing a new kind of material or product.
cs: **H**: Výroba nového druhu materiálu nebo výrobku.

source: **K**: Processing signals or information.
cs: **K**: Zpracování signálů nebo informací.

source: **M**: Providing mechanical energy for driving purposes.
cs: **M**: Poskytování mechanické energie pro účely pohonu (napájení).

source: **P**: Presenting information.
cs: **P**: Poskytování informací.

source: **Q**: Controlled switching or varying a flow of energy, of signals or of material.
cs: **Q**: Řízené přepínání nebo změna toku energie, signálů nebomateriálu.

source: **R**: Restricting or stabilizing motion or a flow of energy or material.
cs: **R**: Omezení nebo ustálení pohybu nebo toku energie nebo materiálu.

source: **S**: Converting a manual operation into a signal for further processing.
cs: **S**: Převod ruční operace na signál pro další zpracování.

source: **T**: Conversion of energy maintaining the kind of energy.
cs: **T**: Přeměna energie při zachování druhu energie.

source: **U**: Keeping objects in a defined position.
cs: **U**: Udržování předmětů ve stanovené poloze.

source: **V**: Processing (treating) of material or products.
cs: **V**: Zpracování (ošetření) materiálu nebo výrobků.

source: **W**: Guiding or transporting from one place to another.
cs: **W**: Vedení nebo přeprava z jednoho místa na druhé.

source: **X**: Connecting objects
cs: **X**: Spojování předmětů.

source: Alphanumeric code which identify the element.
cs: Alfanumerický kód, který určuje prvek.

source: For more information about how to define auto numbering patterns, refer to `project auto numbering properties`_ section.
cs: Další informace o tom, jak stanovit automatické číslovací vzory, naleznete v části `vlastnosti automatického číslování projektu`_.

source: For more information about how to manage the codification of conductors, refer to `add element`_ section.
cs: Další informace o tom, jak spravovat utřídění vodičů,naleznete v části k `přidání prvku`_.
