Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/export&print/export_schema.po
Languages: cs

source: Export schema
cs: Vyvedení výkresu

source: QElectroTech allows exporting the different `folios`_ to many type of formats: **PNG**, **JPEG**, **Bitmap**, **SVG** and **DWX**.
cs: QElectroTech umožňuje vyvedení různých `listů`_ do mnoha typůformátů: **PNG**, **JPEG**, **Bitmap**, **SVG** a **DWX**.

source: Select **File > Export** menu item to display exporting PopUP window.
cs: Pro zobrazení vyskakovacího okna pro vyvedení vyberte položku nabídky **Soubor > Vyvést**.

source: Figure: QElectroTech file menu
cs: Obrázek: Nabídka pro soubor v QElectroTechu

source: QElectroTech allows using keyboard shortcuts to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesové zkratky ke zvýšení účinnosti práce.

source: Press ``Ctrl + Shift + X`` to display exporting PopUP window.
cs: Pro zobrazení vyskakovacího okna pro vyvedení stiskněte ``Ctrl + Shift + X``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.

source: Choose the `folios`_ you wish to export and specify their size.
cs: Vyberte `listy`_, které chcete vyvést, a určete jejich velikost.

source: Figure: QElectroTech export PopUP window
cs: Obrázek: Vyskakovací okno pro vyvedení v QElectroTechu

source: Choose target directory and format.
cs: Vyberte cílový adresář a formát.

source: Figure: QElectroTech exporting formats combo box
cs: Obrázek: Rozbalovací seznam pro vyvádění formátů v QElectroTechu

source: Choose rendering options.
cs: Zvolte vykreslovací volby.

source: Figure: QElectroTech rendering options
cs: Obrázek: Volby pro vykreslování v QElectroTechu

source: Press **Export** button to create the files.
cs: Pro vytvoření souborů stiskněte tlačítko **Vyvést**

source: QElectroTech creates one file for each folio choosed at the target directory defined.
cs: QElectroTech vytvoří jeden soubor pro každé folio vybrané ve stanoveném cílovém adresáři.

source: QElectroTech allows predefining exporting settings for reducing the working configuration effort each time that a `project`_ have to be exported, refer to `export settings`_ section for more information.
cs: QElectroTech umožňuje předem stanovit nastavení vyvedení pro omezení pracovního úsilí spojeného s nastavováním pokaždé, když je třeba `projekt`_ vyvést. Další informace najdete v části k `nastavení vyvedení`_.
