Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/elements.po
Languages: cs

source: Interface elements
cs: Prvky rozhraní

source: QElectroTech has been designed using `Qt`_ framework and widget toolkit. The main window from QElectroTech is the same for all platforms where it is available (Windows, Linux/Unix and MacOS). The main window from QElectroTech contains the following areas:
cs: QElectroTech byl navržen s použitím systému a sady doplňkových nástrojů `Qt`_. Hlavní okno v QElectroTechu je stejné pro všechny platformy, pro něž je dostupné (Windows, Linux / Unix a MacOS). Hlavní okno QElectroTechu obsahuje následující oblasti:

source: :greentext:`Menu bar`
cs: :greentext:`Hlavní nabídka`

source: :bluetext:`Toolbars`
cs: :bluetext:`Nástrojové pruhy`

source: :yellowtext:`Workspace`
cs: :yellowtext:`Pracovní plocha`

source: :orangetext:`Panels`
cs: :orangetext:`Panely`

source: :redtext:`Project tabs bar`
cs: :redtext:`Pruh s kartami projektů`

source: :lilactext:`Folio tabs bar`
cs: :lilactext:`Pruh s kartami listů`

source: :browntext:`Help bar`
cs: :browntext:`Pruh s nápovědou`

source: :pinktext:`Search Menu`
cs: :pinktext:`Nabídka pro vyhledávání`

source: Figure: QElectroTech main window
cs: Obrázek: Hlavní okno v QElectroTechu
