Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/menu_bar.po
Languages: cs

source: Menu bar
cs: Pruh s nabídkou

source: The menu bar is placed at top from QElectroTech interface. QElectroTech contains the menus ``File``, ``Edit``, ``Project``, ``Display``, ``Settings``, ``Windows`` and ``Help``. Each menu provides many diferent options.
cs: Pruh s nabídkou je umístěn v horní části rozhraní QElectroTechu. QElectroTechobsahuje nabídky ``Soubor``, ``Úpravy``, ``Projekt``, ``Zobrazení``,``Nastavení``, ``Okna`` a ``Nápověda``. Každá nabídka poskytuje mnoho různýchvoleb.

source: A brief description of each menu option can be read from `help or information tool bar`_ by hovering over the option with the cursor.
cs: Stručný popis každé položky nabídky lze přečíst v `nápovědě nebopanelu nástrojů s informacemi`_ přejetím ukazovátkem nad volbou.

source: File menu
cs: Nabídka Soubor

source: Figure: QElectroTech file menu
cs: Obrázek: Nabídka Soubor QElectroTechu

source: Option
cs: Volba

source: Function
cs: Funkce

source: Keyboard shortcut
cs: Klávesová zkratka

source: Icon
cs: Ikona

source: Latest files
cs: Nedávno otevřené soubory

source: Opens a project from history (recently opened files)
cs: Otevře projekt z historie (nedávno otevřené soubory)

source: |document-recent|
cs: |dokument-nedávný|

source: New
cs: Nový

source: Creates a new Project
cs: Vytvoří nový projekt

source: |project-new|
cs: |projekt-nový|

source: Open
cs: Otevřít

source: Opens an existing project
cs: Otevře existující projekt

source: |project|
cs: |projekt|

source: Save
cs: Uložit

source: Saves the current project and all its folios
cs: Uloží nynější projekt a všechny jeho listy

source: |document-save|
cs: |dokument-uložit|

source: Save as
cs: Uložit jako

source: Saves the current project with a different file name
cs: Uloží nynější projekt pod jiným souborovým názvem

source: |document-save-as|
cs: |dokument-uložit-jako|

source: Close
cs: Zavřít

source: Closes the current project
cs: Zavře nynější projekt

source: |project-close|
cs: |projekt-zavřít|

source: Export
cs: Vyvést

source: Exports the curret folio to another format
cs: Vyvede nynější list do jiného formátu

source: |document-export|
cs: |dokument-vyvést|

source: Print
cs: Tisk

source: Print one or more folio of the current project
cs: Vytisknout jeden nebo více listů nynějšího projektu

source: |document-print|
cs: |dokument-tisk|

source: Quit
cs: Ukončit

source: Closes QElectroTech
cs: Zavře QElectroTech

source: |application-exit|
cs: |program-ukončit|

source: Edit menu
cs: Nabídka pro úpravy

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Undo
cs: Zpět

source: Undoes the previous action
cs: Vrátí zpět předchozí krok

source: |edit-undo|
cs: |upravit-zpět|

source: Redo
cs: Znovu

source: Restores the undone action
cs: Obnoví krok vrácený zpět

source: |edit-redo|
cs: |upravit-znovu|

source: Cut
cs: Vyjmout

source: Puts selected elements into the clipboard
cs: Vloží vybrané prvky do schránky

source: |edit-cut|
cs: |upravit-vyjmout|

source: Copy
cs: Kopírovat

source: Copies selected elements
cs: Zkopíruje vybrané prvky

source: |edit-copy|
cs: |upravit-kopírovat|

source: Paste
cs: Vložit

source: Pastes elements from the clipboard into the folio
cs: Vloží prvky ze schránky do listu

source: |edit-paste|
cs: |upravit-vložit|

source: Select All
cs: Vybrat vše

source: Selects all elments on the folio
cs: Vybere všechny prvky na listu

source: |edit-select-all|
cs: |upravit-vybrat-vše|

source: Select none
cs: Nevybrat nic

source: Deselect all elments on the folio
cs: Zrušit výběr všech prvků na listu

source: |edit-select-none|
cs: |upravit-vybrat-žádný|

source: Invert selection
cs: Obrátit výběr

source: Inverts selection of elements
cs: Obrátí výběr prvků

source: |edit-select-invert|
cs: |upravit-vybrat-obrátit|

source: Delete
cs: Smazat

source: Removes selected elements from the folio
cs: Odebere vybrané prvky z listu

source: |edit-delete|
cs: |upravit-smazat|

source: Rotate
cs: Otočit

source: Rotates selected elements and texts
cs: Otočí vybrané prvky a texty

source: ``Space``
cs: ``Mezerník``

source: |transform-rotate|
cs: |proměnit-otočit|

source: Choose texts orientation
cs: Vybrat natočení textu

source: Rotates selected texts to a specific angle
cs: Otočí vybrané texty do určitého úhlu

source: ``Ctrl + Space``
cs: ``Ctrl + mezerník``

source: |object-rotate-right|
cs: |předmět-otočit-vpravo|

source: Find in the panel
cs: Najít v panelu

source: Finds the selected element in the collections panel
cs: Vyhledá vybraný prvek v panelu se sbírkami

source: |zoom-draw|
cs: |přiblížit-kreslit|

source: Edit the selected object
cs: Upravit vybraný předmět

source: Displays properties for the selected element / conductor
cs: Zobrazí vlastnosti vybraného prvku/vodiče

source: |element-edit|
cs: |prvek-upravit|

source: Group selected texts
cs: Seskupit vybrané texty

source: Reset conductors
cs: Obnovit výchozí vodiče

source: Resets the conductors path ignoring the user changes
cs: Obnoví výchozí cestu vodičů přehlížeje uživatelské změny

source: |conductor-reset|
cs: |vodič-obnovit výchozí|

source: Folio properties
cs: Vlastnosti listu

source: Edits the properties of the folio
cs: Upraví vlastnosti listu

source: |folio-properties|
cs: |list-vlastnosti|

source: Add a column
cs: Přidat sloupec

source: Adds a column to the folio
cs: Přidá sloupec do listu

source: |insert-column-right|
cs: |vložit-sloupec-vpravo|

source: Remove a column
cs: Odstranit sloupec

source: Removes a column from the folio
cs: Odebere sloupec z listu

source: |delete-column|
cs: |smazat-sloupec|

source: Add a row
cs: Přidat řádek

source: Adds a row to the folio
cs: Přidá řádek do listu

source: |insert-row-under|
cs: |vložit-řádek-pod|

source: Remove a row
cs: Odstranit řádek

source: Removes a row from the folio
cs: Odebere řádek z listu

source: |delete-row|
cs: |smazat-řádek|

source: Bring to front
cs: Přesunout dopředu

source: Brings the selection (s) to front
cs: Přesune výběr dopředu (s)

source: |bring_forward|
cs: |přesunout_dopředu|

source: Raise
cs: Zvýšit

source: Aproachs the selection (s)
cs: Přistoupí k výběru (s)

source: ``Ctrl + Shift + Up``
cs: ``Ctrl + Shift + Nahoru``

source: |raise|
cs: |zvýšit|

source: Lower
cs: Snížit

source: Moves away the selection (s)
cs: Vzdálí výběr (s)

source: ``Ctrl + Shift + Down``
cs: ``Ctrl + Shift + Dolů``

source: |lower|
cs: |snížit|

source: Send backwards
cs: Přesunout dozadu

source: Sends in the backwards the selection (s)
cs: Přesune výběr dozadu (s)

source: |send_backward|
cs: |přesunout_dozadu|

source: Search / Replace
cs: Hledat/Nahradit

source: Display Search / Replace panel
cs: Zobrazit panel Hledat/Nahradit

source: Project menu
cs: Nabídka projektu

source: Figure: QElectroTech project menu
cs: Obrázek: Nabídka projektu QElectroTechu

source: Project properties
cs: Vlastnosti projektu

source: Display project properties PopUp window
cs: Zobrazit vyskakovací okno s vlastnostmi projektu

source: |project-properties|
cs: |projekt-vlastnosti|

source: Add a folio
cs: Přidat list

source: Adds a new folio (drawing sheet) to the active project.
cs: Přidá do činného projektu nový list (list výkresu).

source: |folio-new|
cs: |list-nový|

source: Delete this folio
cs: Smazat tento list

source: Deletes the active folio (drawing sheet) of the project
cs: Smaže činný list (list výkresu) z projektu

source: |folio-delete|
cs: |list-smazat|

source: Clean project
cs: Vyčistit projekt

source: Purges the active project of unused elements and empty categories and templates
cs: Zbaví činný projekt nepoužívaných prvků a prázdných skupin avzorů

source: |edit-clear|
cs: |upravit-vyprázdnit|

source: Add a summary
cs: Přidat stručný obsah

source: Creates an index folio for the active project
cs: Vytvoří list rejstříku pro činný projekt

source: |table-of-content|
cs: |obsah|

source: Export parts list
cs: Vyvést seznam částí

source: Generates a ``.csv`` file summary of all elements used in the active project
cs: Vytvoří přehledový soubor ``.csv`` všech prvků použitých v činnémprojektu

source: |export-csv|
cs: |vyvést-csv|

source: Launch the terminal block creation pluging
cs: Spustit přídavný modul pro vytvoření svorkovnice

source: |terminalstrip|
cs: |terminálový-proužek|

source: Display menu
cs: Nabídka pro zobrazení

source: Figure: QElectroTech display menu
cs: Obrázek: Nabídka QElectroTechu pro zobrazení

source: Display projects
cs: Pohled na projekty

source: Shows the various opened projects in windows or tabs
cs: Ukáže různé otevřené projekty v oknech nebo v kartách

source: |configure-toolbars|
cs: |nastavit-nástrojové pruhy|

source: Select
cs: Vybrat

source: Allows to select elements
cs: Umožňuje vybrat prvky

source: |select|
cs: |vybrat|

source: Move
cs: Přesunout

source: Allows to view the folio without modifying it
cs: Umožňuje list zobrazit bez jeho úpravy

source: |move|
cs: |přesunout|

source: Display the grid
cs: Zobrazit mřížku

source: Displays or hidden the grid of folio
cs: Zobrazí nebo skryje mřížku listu

source: |grid|
cs: |mřížka|

source: Background color white / gray
cs: Barva pozadí bílá/šedá

source: Displays the background color of the folio in white or gray
cs: Zobrazí barvu pozadí listu v bílé nebo šedé barvě

source: |diagram_bg|
cs: |diagram_pozadí|

source: Zoom In
cs: Přiblížit

source: Expands the folio
cs: Zvětší list

source: |zoom-in|
cs: |přiblížit|

source: Zoom Out
cs: Oddálit

source: Shrinks the folio
cs: Zmenší list

source: |zoom-out|
cs: |oddálit|

source: Zoom content
cs: Přiblížit obsah

source: Adjusts the zoom to display all the content of folio regardless of context
cs: Upraví přiblížení tak, aby se zobrazoval veškerý obsah listu bez ohledu na souvislosti

source: Fit in view
cs: Přizpůsobit přiblížení

source: Adjusts the zoom on exactly trhe part of the folio
cs: Nastaví přiblížení přesně na část listu

source: |view-fit-window|
cs: |pohled-přizpůsobit-oknu|

source: Reset zoom
cs: Bez přiblížení

source: Restores default zoom level
cs: Obnoví výchozí úroveň přiblížení

source: |zoom-original|
cs: |zvětšení-původní|

source: Settings menu
cs: Nabídka pro nastavení

source: Figure: QElectroTech settings menu
cs: Obrázek: Nabídka pro nastavení QElectroTechu

source: Display
cs: Zobrazení

source: Displays or hides toolbars and panels
cs: Zobrazí nebo skryje nástrojové pruhy a panely

source: Full screen mode
cs: Režim na celou obrazovku

source: Displays QElectroTech in full screen mode
cs: Zobrazí QElectroTech v režimu na celou obrazovku

source: |view-fullscreen|
cs: |pohled-celá-obrazovka|

source: Configure QElectroTech
cs: Nastavit QElectroTech

source: Allows specifying various parameters for QElectroTech
cs: Umožňuje zadat různé parametry pro QElectroTech

source: |configure|
cs: |nastavit|

source: Windows menu
cs: Nabídka pro okna

source: Figure: QElectroTech windows menu
cs: Obrázek: Nabídka pro okna QElectroTechu

source: Tile
cs: Klást jedno vedle druhého

source: Adds a new drawing sheet to the active project. (Folio means drawing sheet)
cs: Přidá do činného projektu nový list výkresu. (List znamená list výkresu)

source: Cascade
cs: Překrývat

source: Deletes the active drawing of the project
cs: Smaže činný list výkresu z projektu

source: Next Project
cs: Nový projekt

source: Activates the next project
cs: Spustí další projekt

source: Previous Project
cs: Předchozí projekt

source: Activates the previous project
cs: Spustí předchozí projekt

source: (Opened Projects)
cs: (otevřené projekty)

source: Below **Previous Project** QElectroTech list all opened projects to select the active project
cs: Pod **Předchozí projekt ** QElectroTech uvádí seznam všech otevřených projektůpro vybrání činného projektu

source: Help menu
cs: Nabídka s nápovědou

source: Figure: QElectroTech help menu
cs: Obrázek: Nabídka s nápovědou QElectroTechu

source: What's This?
cs: Co je to?

source: Enquires main menu options
cs: Zjišťuje možnosti hlavní nabídky

source: About QElectroTech
cs: O programu QElectroTech

source: Displays information about QElectroTech
cs: Zobrazí informace o programu QElectroTech

source: |qet-icon|
cs: |qet-ikona|

source: Online manual
cs: Příručka na internetu

source: Lauches the default browser to the online manual of QElectroTech
cs: Spustí výchozí prohlížeč internetové příručky pro QElectroTech

source: |help-contents|
cs: |nápověda-obsah|

source: Youtube channel
cs: Kanál Youtube

source: Lauches the default browser on the Youtube channel of QElectroTech
cs: Spustí výchozí prohlížeč na kanál Youtube pro QElectroTech

source: |show-video|
cs: |ukázat-video|

source: Support the project with a donation
cs: Podpořte projekt darem

source: Lauches the default browser on the QElectroTech donation paypal account
cs: Spustí výchozí prohlížeč na dárcovský účet Paypal pro QElectroTech

source: |help-donate|
cs: |nápověda-darovat|

source: About Qt
cs: O Qt

source: Displays information about `Qt`_ library
cs: Zobrazí informace o knihovně `Qt`_

source: |qt-icon|
cs: |qt-ikona|
