Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/reports/nomenclature/edit_nomenclature.po
Languages: cs

source: Edit nomenclature
cs: Upravení seznamu součástí

source: The nomenclature properties can only be displayed from `selection properties panel`_ once the summary table has been selected at `workspace`_.
cs: Vlastnosti seznamu součástí lze zobrazit jen v `panelu s vlastnostmi výběru`_, jakmile byla tabulka souhrnu vybrána v `pracovní ploše`_.

source: Figure: QElectroTech nomenclature properties panel, display tab
cs: Obrázek: Karta pro zobrazení, panel s vlastnostmi seznamu součástí v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**.
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**.

source: Nomenclature geometry and line
cs: Umístění a řádky seznamu součástí

source: Figure: QElectroTech summary geometry and lines properties
cs: Obrázek: Vlastnosti umístění a řádků souhrnu v QElectroTechu

source: The **Geometry and lines** section from the summary properties allows defining:
cs: Část **Umístění a řádky** vlastností souhrnu umožňuje stanovit:

source: Nomenclature table position (coordinates **X** and **Y**) in the `folio`_.
cs: Poloha tabulky se seznamem součástí (souřadnice **X** a **Y**) v `listu`_.

source: Maximum number of table rows.
cs: Nejvyšší počet řádků v tabulce.

source: Adjust the size of the table to the `folio`_, automatic margin definition.
cs: Upravit velikost tabulky v `listu`_, automatické stanovení okraje.

source: Define previous nomenclature table, property to be used if the nomenclature table is not fitting in one `folio`_.
cs: Stanovte předchozí tabulku se seznamem součástí, vlastnost, která se má použít, pokud se tabulka se seznamem součástí nevejde do jednoho `listu`_.

source: If the table is not fitting in one `folio`_, each nomenclature table has to have a **Table name** defined. Without **Table name**, the link between tables cannot be defined.
cs: Pokud se tabulka nevejde do jednoho `listu`_, má mít každá tabulka se seznamem součástí stanoven **Název tabulky**. Bez **Názvu tabulky**, nelze stanovit propojení mezi tabulkami.

source: Header
cs: Záhlaví

source: Figure: QElectroTech nomenclature header properties
cs: Obrázek: Vlastnosti záhlaví seznamu součástí v QElectroTechu

source: The **Header** section from the nomenclature properties allows defining:
cs: Část **Záhlaví** vlastností seznamu součástí umožňuje stanovit:

source: Top, bottom, left and right margin in the header cells.
cs: Horní, dolní, levý a pravý okraj v buňkách záhlaví.

source: Text alignment in the header cells.
cs: Zarovnání textu v buňkách záhlaví.

source: Text font of the table header.
cs: Písmo textu v záhlaví tabulky.

source: Figure: QElectroTech nomenclature table text font
cs: Obrázek: Písmo textu v tabulce se seznamem součástí v QElectroTechu

source: Table
cs: Tabulka

source: Figure: QElectroTech nomenclature table properties panel
cs: Obrázek: Panel s vlastnostmi tabulky se seznamem součástí v QElectroTechu

source: The **Table** section from the nomenclature properties allows defining:
cs: Část **Tabulka** vlastností seznamu součástí umožňuje stanovit:

source: Top, bottom, left and right margin in the table cells.
cs: Horní, dolní, levý a pravý okraj v buňkách tabulky.

source: Text alignment in the table cells.
cs: Zarovnání textu v buňkách tabulky.

source: Text font of the table.
cs: Písmo textu v tabulce.

source: Content request
cs: Požadavek na obsah

source: The `element properties`_ to be displayed at the nomenclature table, the columns information, can be modified and re-organized at any time.
cs: `Vlastnosti prvku`_, které se zobrazí v tabulce se seznamem součástí. Informace o sloupcích lze kdykoli upravit a znovu uspořádat.

source: To modify the content request from nomenclature:
cs: Pro upravení požadavku na obsah seznamu součástí:

source: `Select`_ one of the tables from the nomenclature to display the nomenclature properties at `selection properties panel`_.
cs: `Vyberte`_ jednu z tabulek seznamu součástí pro zobrazení vlastností v `panelu s vlastnostmi výběru`_.

source: Go to **Content** tab.
cs: Jděte do karty **Obsah**.

source: Figure: QElectroTech nomenclature properties panel, content tab
cs: Obrázek: Karta pro obsah, panel s vlastnostmi seznamu součástí v QElectroTechu

source: Click **Request** button to display the content configuration PopUp window.
cs: Klepněte na tlačítko **Žádost** pro zobrazení vyskakovacího okna pro nastavení obsahu.

source: Modify the list of information to be displayed by the commands of the following table.
cs: Upravte seznam informací, které se mají zobrazit, pomocí příkazů v následující tabulce.

source: Icon
cs: Ikona

source: Action
cs: Činnost

source: Keyboard shortcut
cs: Klávesová zkratka

source: Move up this field
cs: Posunutí pole nahoru

source: Add field to display list
cs: Přidání pole do seznamu zobrazených

source: Double click on field at available list
cs: Dvakrát klepněte na pole v seznamu dostupných

source: Remove field from display list
cs: Odstranění pole ze seznamu zobrazených

source: Double click on field at display list
cs: Dvakrát klepněte na pole v seznamu zobrazených

source: Move down this field
cs: Posunutí pole dolů

source: Figure: QElectroTech nomenclature properties content request PopUp window
cs: Obrázek: Vyskakovací okno pro požadavek na obsah s vlastnostmi seznamu součástí v QElectroTechu

source: The content request configuration can be saved and chosen from **Configuration** section to increase working efficiency.
cs: Nastavení požadavku na obsah lze uložit a zvolit v části **Nastavení** pro zvýšení účinnosti práce.

source: QElectroTech is working with SQLite database, nomenclature table content can also be defined by SQL query.
cs: QElectroTech pracuje s databází SQLite, obsah tabulky se seznamem součástí může být stanoven také dotazem SQL.

source: Once the desired configuration is defined, press **OK** to apply changes.
cs: Jakmile je požadované nastavení stanoveno, stiskněte **OK** pro provedení změn.
