Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_edit.po
Languages: cs

source: Edit title block
cs: Upravení záhlaví výkresu

source: QElectroTech only allows editing the templates from `User collection`_ or `project embedded collection`_. The `QET collection`_ title blocks cannot be edited.
cs: QElectroTech umožňuje úpravy šablon pouze z `Vlastní sbírky`_ nebo `vložené sbírky projektu`_. Záhlaví výkresů ve `sbírce QET`_ nelze upravit.

source: QElectroTech allows opening the title block templates from `QET collection`_ with `title block editor`_. Once the template is modified, it has to be saved using the option **Save as** and create a new template.
cs: QElectroTech umožňuje otevírání vzorů záhlaví výkresů ve `sbírce QET`_ v `editoru záhlaví výkresu`_. Jakmile je vzor upraven, musí být uložen pomocí volby **Uložit jako**, čímž se vytvoří nový vzor.

source: Edit title block from menu bar
cs: Upravení záhlaví výkresu přes hlavní nabídku

source: Select **Project > Project properties > New folio** menu item to display `default folio properties`_ from `project`_.
cs: Pro zobrazení `výchozích vlastností listu`_ `projektu`_ vyberte položku nabídky **Projekt > Vlastnosti projektu > Nový list**.

source: Go to `title block informations`_ and select the title block which should be edited.
cs: Jděte do `údajů v záhlaví výkresu`_ a vyberte záhlaví výkresu, které se má upravit.

source: Select the option **Edit this template** to display `title block editor`_.
cs: Vyberte volbu **Upravit tento vzor** pro zobrazení `editoru záhlaví výkresu`_.

source: Figure: QElectroTech new folio properties PopUP window
cs: Obrázek: Vyskakovací okno s vlastnostmi nového listu v QElectroTechu

source: Edit title block from folio properties
cs: Upravení záhlaví výkresu přes vlastnosti listu

source: `Display folio properties`_ from one of the `folios`_ of the `project`_.
cs: `Zobrazení vlastností listu`_ z jednoho z `listů`_ `projektu`_.

source: Figure: QElectroTech folio properties PopUP window
cs: Obrázek: Vyskakovací okno s vlastnostmi listu v QElectroTechu

source: Edit title block from project panel
cs: Upravení záhlaví výkresu z panelu s projektem

source: Right click on one title block template which should be edited.
cs: Klepněte pravým tlačítkem myši na vzor záhlaví výkresu, které se má upravit

source: Click the option **Edit this template** to open the template with `title block editor`_.
cs: Klepněte na volbu **Upravit tento vzor** pro otevření vzoru v `editoru záhlaví výkresu`_.

source: Figure: QElectroTech Project panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `project panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**.
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**.
