Repository: Aleksandr277/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/new_project.po
Languages: cs

source: Create new project
cs: Vytvoření nového projektu

source: A new `project`_ can be created from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Nový `projekt`_ lze vytvořit přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: Create new project from menu bar
cs: Vytvoření nového projektu přes hlavní nabídku

source: Select **File > New** menu item to create a new `project`_.
cs: Pro vytvoření nového `projektu`_ vyberte položku nabídky **Soubor > Nový**.

source: Figure: QElectroTech file menu
cs: Obrázek: Nabídka pro soubor v QElectroTechu

source: Create new project from toolbar
cs: Vytvoření nového projektu přes pruh s nástroji

source: Select the icon |project-new| from `toolbar`_ to create a new `project`_.
cs: Pro vytvoření nového `projektu`_ vyberte ikonu |project-new| v `panelu nástrojů`_

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**

source: Create new project using keyboard shortcut
cs: Vytvoření nového projektu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + n`` to create a new `project`_.
cs: Pro vytvoření nového `projektu`_ stiskněte ``Ctrl + n``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
